{
   "ServiceProvider-yoruyjsfane6zfwi54uakwddje-dev": [
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Meta House" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Recovery Community" },
      "Description": {"S": "Our Recovery Community offers a safe, affordable, and supportive place for women in early recovery to live. There are two divisions of our housing program, one that serves single women and one that serves women with children. Single women enjoy a private bedroom and share common living spaces with another woman in the program. Women with children enjoy a private two- or three-bedroom apartment based on the family’s need. Each division is clinically-supervised and offers residents a furnished apartment and access to a full array of outpatient treatment services and on-site staff. \n\nAt Meta House’s 25 furnished and supervised apartments, single women and families with children are provided a safe, clean environment while women and moms work on their recovery. Women who come to these apartments often lack a support system and safe place to live and have little to no ability to pay for housing. Our Sober Living Community will continue to offer women the opportunity to learn and practice coping skills and find appropriate long-term housing. Within this community, women and families will also have the support of Consumer Peer Specialists and peers who are committed to recovery from substance use disorder. While living in Meta House’s Sober Living Community, women will be asked to engage in 20 hours of meaningful activities per week while continuing to focus on their recovery." },
      "Tags": {"SS": [ "Behavioral Health & Mental Health", "Housing" ] },
      "Address": {"S": "2625 N. WEIL STREET \nMILWAUKEE, WI 53212 \n" },
      "Phone": {"S": "414.962.1200" },
      "Fax": {"S": "414.962.2305" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.metahouse.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Meta House" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Mental Health Services" },
      "Description": {"S": "Mental Health Services are often needed for women who are dependent on substances because they typically suffer from co-occurring mental health disorders (a mental health disorder diagnosis along with a substance use disorder diagnosis). Women who use or are dependent on substances are very likely to have a history of childhood and/or adult abuse and trauma, which sometimes results in mental health concerns. With a multi-disciplinary and experienced staff, Meta House is uniquely equipped to support such women.\n\nAt Meta House, we treat the whole person and women who suffer from mental health disorders face an additional barrier to recovery. We ensure that women who suffer from a co-occurring mental health disorder receive appropriate diagnoses, support and treatment and are equipped with the tools to manage their disorders, which increases their likelihood of successful recovery. All staff are specially-trained to understand the dynamics of mental health and substance use, especially when there is a history of trauma and abuse.\n\nService Components \n- Professional Staff: Meta House is staffed with a psychiatrist who is also an addictionologist, Master’s level mental health staff, and consulting psychologists. \n\n- Trauma Treatment: a program specifically for women with substance use disorders. \n\n- Parenting Program for women with histories of childhood sexual abuse and other trauma. \n\n- Mental Health Assessments conducted by Wisconsin School of Psychiatry students. \n\n- Referral Services to connect women with additional support when necessary." },
      "Tags": {"SS": [ "Behavioral Health & Mental Health" ] },
      "Address": {"S": "2625 N. WEIL STREET \nMILWAUKEE, WI 53212 \n" },
      "Phone": {"S": "414.962.1200" },
      "Fax": {"S": "414.962.2305" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.metahouse.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "MICAH" },
      "Type": {"S": "" },
      "Program and Services": {"S":"MICAH'S ROC Wisconsin Taskforce" },
      "Description": {"S": "Restoring our Communities beyond 11 x 15 (ROC Wisconsin) is a statewide campaign of WISDOM. It began in 2011 as “11 X 15 For Safer, Healthier Communities” with a goal of reducing Wisconsin’s prison population by half — to 11,000 — by the end 2015. During those four years, we advocated for prison reform through health impact studies, Power Point presentations, actions, events, and media coverage.\n\nIn 2016 we renamed our campaign “ROC Wisconsin: Restoring our Communities beyond 11×15.” Our goals are to:\n\n- Restore communities that have been harmed by mass incarceration;\n- Restore families to wholeness and health;\n- Restore balance, fiscal discipline and humane priorities to our state’s criminal justice system;\n- Restore people to health through increased treatment alternatives to incarceration, decreased use of solitary confinement, and better support for those who return from jail or prison;\n- Restore men and women back to the community who do not need to be\n\nDuring 2017-2018, MICAH will be highlighting the issue of Crimeless Revocation. Presently people on probation, parole, or extended supervision can be revoked and re-incarcerated for violating rules of supervision even though they have not committed new offenses.\n\nA health impact assessment entitled “Excessive Revocations in Wisconsin” shows that Wisconsin incarcerated 3,000 individuals for crimeless revocations in 2015 alone. Thousands of others, who were never revoked, were held in county jails and state detention facilities while the Department of Corrections considered alleged rule violations.\n\nStatewide, MICAH with ROC Wisconsin is working:\n\nTo expand funds for Treatment Alternative and Diversion (TAD). TAD funds drug treatment courts, family courts, mental health courts and other interventions–which have proven more effective than incarceration in reducing recidivism. Evaluation of TAD-funded programs shows they save taxpayers $2 for every $1 the state has invested.\nTo pass the Second Chance This bipartisan legislation wouldreturn most 17-year-olds to the juvenile justice system. Concerns about the fiscal impact of the measure have been delaying passage.\nTo reduce and/or eliminate solitary confinement — now called segregation, administrative confinement, or restrictive Eliminate such isolation for mentally-ill prisoners and juveniles. End use of long-term confinement and document the number of days inmates spend in all levels of segregation.\nTo realize parole release for those eligible who can be released safely, and compassionate release for elderly and/or very ill prisoners who are no longer a danger to society.\nJoin us on the second Wednesday of every month at 5 pm for our task force meeting at the Project Return conference room, Welford Sanders Enterprise Center, 2821 N 4th St Suite 221, Milwaukee" },
      "Tags": {"SS": [ "Health", "Behavioral Health" ] },
      "Address": {"S": "2625 N. WEIL STREET \nMILWAUKEE, WI 53212 \n" },
      "Phone": {"S": "414.962.1200" },
      "Fax": {"S": "414.962.2305" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.metahouse.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "MICAH" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Ezekial Community Development Corporation" },
      "Description": {"S": "Since January 2016, Ezekiel Community Development Corporation has accomplished the following tasks in its effort to stabilize neighborhoods, decrease crime, and increase minority wealth:\n\nRehabilitated 9 properties – each property used as a “classroom” to train and create jobs for individuals who are hard to employ\nTrained and employed 34 Residential Preference Program (RPP) individuals in construction skills\nTrained and employed 40 House of Correction residents\nHired 50 city-located Disadvantaged Business Enterprises (DBE) minority contractors\nSold the nine rehabilitated properties to low-income, first-time home buyers\nEzekiel is one of six buyers recommended by city officials to participate in Milwaukee’s employment and renovation initiative for the Sherman Park neighborhood and surrounding areas.\n\nEzekiel CDC is an example of a project that began in MICAH and became its own organization with MICAH’s full support. Visit our website at www.ezekielcdc.com" },
      "Tags": {"SS": [ "Housing" ] },
      "Address": {"S": "MICAH-Milwaukee Inner-city Congregations Allied for Hope \n\nWelford Sanders (Milwaukee) Enterprise Center \n\n2821 N 4th St, Suite 213 \n\nMilwaukee, WI 53212 \n\n\n" },
      "Phone": {"S": "414-264-0805" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://micahmke.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "MICAH" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"MICAH Jobs and Economics Task Force" },
      "Description": {"S": "MICAH’S Jobs and Economic Development Task Force pursues a variety of economic justice issues, none more important than our Westlawn subcommittee’s continued work with other organizations across the nation to ensure federal Housing and Urban Development Section 3 spending fulfills its intended purpose. \n\nHUD spends billions of dollars in distressed communities for projects that build and rehabilitate housing and improve roads and community centers. The Section 3 regulation acknowledges this spending typically generates new contracting, employment, and other economic opportunities and multiplier effects. Original policy required a preference that a fair share of these benefits got to low and very low income residents (regardless of race or gender) in the form of employment, training, and contract opportunities. \n\nUnfortunately, and due in part to a changing economic landscape since these regulations came into effect in 1968, Section 3 goals were not being met in many cities, including Milwaukee. Due in part to a complaint filed by MICAH, the Housing Authority of the City of Milwaukee (HACM) was found to be in non-compliance with section regulations with respect to the phase I of the Westlawn Project, a $200 million neighborhood housing and redevelopment initiative. \n\nBased on the findings from that complaint, the HACM entered into an agreement with HUD in August 2014 and later announced a revised Section 3 plan would be available for public review and comment. The authority collected public comment at four public meetings and prepared a revised proposal that HUD must now approve. HACM will prepare a revised proposal that will be submitted to HUD for approval. \n\nThanks in part to MICAH and other organizations across the nation who have battled with how the Section 3 requirements have been implemented, HUD finally realizes that these rules need to be updated to accommodate our changing economy. HUD has proposed substantial changes to Section 3 rules which would: \n\n- Establish clearer guidelines for achieving compliance “to the greatest extent feasible.” \n- Require new hires to work a minimum percentage of hours. \n- Revise the definition of a “Section 3 business.” \n- Set a new funding threshold for Public Housing Authority grantees. \n- Require PHA’s and grantees to monitor contractor payroll data. \n- Mandate reference to Section 3 requirements in Project Labor Agreements. \n- Incentivize job retention and apprenticeship opportunities for Section 3 residents. \n- Issue penalties for failure to submit Section 3 annual reports. \n- Impose program sanctions on PHAs and grantees that fail to comply. \n- Stipulate that relief may possibly be provided to aggrieved entities. \n\nMoving forward, MICAH’s Westlawn Sub-committee will continue to meet regularly with HACM officials to ensure that future projects funded with Section 3 dollars will, as they are intended, properly benefit the poor and underserved members of our community." },
      "Tags": {"SS": [ "Employment" ] },
      "Address": {"S": "MICAH-Milwaukee Inner-city Congregations Allied for Hope \n\nWelford Sanders (Milwaukee) Enterprise Center \n\n2821 N 4th St, Suite 213 \n\nMilwaukee, WI 53212 \n\n\n" },
      "Phone": {"S": "414-264-0805" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://micahmke.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Milwaukee County Department of Health and Services" },
      "Type": {"S": "Govt. Org." },
      "Program and Services": {"S":"A New Acute Mental Health Hospital" },
      "Description": {"S": "As part of the Milwaukee County Department of Health and Human Services, the Behavioral Health Division’s role is to ensure everyone in Milwaukee County has access to high-quality, patient-centered behavioral health services, and they are treated with dignity - no matter their severity of illness or ability to pay. Universal Health Services (UHS) brings experience as one of the nation’s leading providers of acute, inpatient mental health care to benefit all individuals in Milwaukee County. They will construct and operate a new, freestanding 120-bed inpatient mental health facility to serve the inpatient behavioral health needs of adolescents, adults and older adults in Milwaukee County. This state-of-the art facility will be an independent hospital open to all members of the community, as well as the individuals treated in BHD’s inpatient hospital. Adding this capacity to our system will make it possible for BHD to focus on increasing access and improving the quality of care available in Milwaukee County." },
      "Tags": {"SS": [ "Behavioral Health & Mental Health", "Health" ] },
      "Address": {"S": "9455 W Watertown Plank Rd.\nWauwatosa, WI\n\n6736 W Washington St. \nWest Allis, WI\n\n2821 N Vel R. Phillips Ave. \nMilwaukee, WI" },
      "Phone": {"S": "Wauwatosa\n(414) 257-8085\n\nWest Allis\n(414) 649-4380\n\nMilwaukee\n(414) 263-6000" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://county.milwaukee.gov/EN" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Milwaukee County Department of Health and Services" },
      "Type": {"S": "Govt. Org." },
      "Program and Services": {"S":"Adult Services \nCommunity Access to Recovery Services (CARS)" },
      "Description": {"S": "A mental health, substance abuse or co-occurring disorder crisis can be very frightening. Knowing where to turn for help can improve your or your loved one’s chances of getting quickly connected to the necessary treatment and recovery services. CARS offers a variety of community-based access point locations that you or your loved one can easily visit or call. \n\nThe staff at each community-based access point location are specially trained to help you or your loved one begin the CARS assessment process. Working with you or your loved one, they will make recommendations for the treatment and recovery services that best meet your needs." },
      "Tags": {"SS": [ "Behavioral Health & Mental Health" ] },
      "Address": {"S": "9455 W Watertown Plank Rd.\nWauwatosa, WI\n\n6736 W Washington St. \nWest Allis, WI\n\n2821 N Vel R. Phillips Ave. \nMilwaukee, WI" },
      "Phone": {"S": "Wauwatosa\n(414) 257-8085\n\nWest Allis\n(414) 649-4380\n\nMilwaukee\n(414) 263-6000" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://county.milwaukee.gov/EN" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Milwaukee County Department of Health and Services" },
      "Type": {"S": "Govt. Org." },
      "Program and Services": {"S":"Milwaukee County Housing First" },
      "Description": {"S": "We provide housing...first.\n\nThe Housing First philosophy provides housing to those most in need without pre-condition. This is because, we have found, the most vulnerable in our community can only solve one life-changing problem at a time. When you are living outside, without a roof over your head or knowing where your next meal will come from, that instantly becomes your most important problem.\n\nDemanding the chronically homeless demonstrate sobriety, a clean bill of mental health, employment or anything else is, from what we have seen, putting the cart before the horse.\n\nHowever, when you remove that housing problem, suddenly the next problem facing that individual becomes \"most important,\" whether it be starting the road to recovery from undiagnosed mental health problems or substance abuse.\n\nMoreover, Milwaukee County Housing First saves a lot of money.\n\nTo Learn More\nhttps://www.youtube.com/watch?time_continue=3&v=pwdq2VWavtc&feature=emb_logo" },
      "Tags": {"SS": [ "Housing" ] },
      "Address": {"S": "" },
      "Phone": {"S": "" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://county.milwaukee.gov/EN/DHHS/Housing/Housing-First" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Milwaukee County Department of Health and Services" },
      "Type": {"S": "Govt. Org." },
      "Program and Services": {"S":"Warming Rooms" },
      "Description": {"S": "Milwaukee Continuum of Care partners Capuchin Community Services (St. Benedict the Moor) will provide overnight shelter for up to 80 single adults and Repairers of the Breach will provide overnight shelter for up to 60 single adults, both opening on nights with temperatures forecasted to be 20 degrees or below.\n\nSt. Benedict the Moor’s warming room, 924 W. State Street, will be open to provide single adults with overnight shelter from 7 p.m. to 7 a.m. St. Benedict the Moor’s warming room will be accessible through 2-1-1 referral and walk in. Repairers of the Breach’s warming room, 1335 W. Vliet Street, will admit those in need of shelter on a walk-in basis from 7 to 10 p.m. and will be open as an overnight shelter until 7 a.m. Milwaukee Rescue Mission Safe Harbor emergency shelter, 1820 W. Wells St., will expand their capacity to add an additional 50 overnight shelter beds for single adult men beginning next week.\n\nContinuum of Care emergency shelters Guest House of Milwaukee and Salvation Army of Milwaukee have also recently expanded their overnight shelter capacity to keep more people who are unsheltered safe and out of the cold weather. Additional Milwaukee warming room location information will be announced at a later date.\n\nThose seeking safety from the cold during the daytime in Milwaukee County are encouraged to go to:\n\nRepairers of the Breach (1335 W. Vliet St.,) open Monday through Saturday from 7 a.m. to 4 p.m.\nSalvation Army Corps locations at 1645 N. 25th St., open Monday through Friday 9 a.m. to 3 p.m. 4129 W. Villard Ave., Milwaukee, open Monday through Friday 9 a.m. to 4 p.m.; 2900 W. Coldspring Ro9:30 a.m. to 3 p.m., Monday through Thursday and Friday from 9:30 a.m. – 12:30 p.m.\nMilwaukee Rescue Mission (1820 W. Wells St.,) open for day shelter any days the temperature is forecasted to be 32 degrees or below.\nAny public building such as Milwaukee County Public Library branches or Milwaukee County Senior Centers.\nMilwaukee Public Library Locations and Hours\nMilwaukee County Federated Library System Locations and Hours\nMilwaukee County Senior Center Locations\n\n\nAll those seeking shelter, energy assistance or other supportive services in Milwaukee County should contact 2-1-1 for assistance and referrals to community resources through any of the following means: \n\nDial: 2-1-1, or (414) 773-0211 \n\nTo avoid being charged a long-distance fee, call 2-1-1 toll-free at (866) 211-3380 \nText your zip code: TXT-211{898-211} Mon.- Fri. 9 a.m.-9 p.m. \n\nChat online: www.impactinc.org/impact-211 \n\nVisit Coordinated Entry for Homeless Services (Resource Center), 1918 N. 6th Street, Alley Entrance, Walk in Hours: Monday, Wednesday and Thursday 8 -11:30 a.m., Tuesdays 1 to 3:30 p.m. \n\nEmail: mailto:ceteam@impactinc.org if special accommodations are needed to complete a services assessment." },
      "Tags": {"SS": [ "Housing" ] },
      "Address": {"S": "" },
      "Phone": {"S": "" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://county.milwaukee.gov/EN/DHHS/Energy-Assistance" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Milwaukee Mental Health Taskforce" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Taskforce" },
      "Description": {"S": "The Milwaukee Mental Health Task Force is the voice of the community on issues related to the quality and responsiveness of mental health and substance abuse disorder services.\n\nThe Milwaukee Mental Health Task Force is committed to being a leader in identifying issues faced by all people affected by mental illness, facilitating improvements in mental health services, giving consumers and families a strong voice, reducing stigma, and implementing recovery principles.\n\nMembership Form\nhttp://www.milwaukeemhtf.org/wp-content/uploads/2017/08/MHTFmembershipForm-June-2019.pdf" },
      "Tags": {"SS": [ "Behavioral Health & Mental Health" ] },
      "Address": {"S": "Milwaukee Mental Health Task Force Meets second Tuesday of the month from 3 – 5 PM, at Independence First, 540 S. 1 St. Milwaukee Facebook: www.facebook.com/milwaukeemhtf" },
      "Phone": {"S": "" },
      "Fax": {"S": "" },
      "Email": {"S": "elisec@drwi.org" },
      "Website": {"S": "www.milwaukeemhtf.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "NAMI - National Alliance on Mental Illness Wisconsin" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Support Group" },
      "Description": {"S": "NAMI Connection Recovery Support Groups are free, confidential, and safe, 90-minute weekly support groups open to anyone with a mental health diagnosis. Groups follow a flexible structure without an educational format. Individuals join a caring group of peers that offer support through their learned wisdom and participants can share as much or as little personal information as they wish.\n\nSee the link below to find locations to the NAMI nearest to you - \nhttps://namiwisconsin.org/find-your-local-nami-2/" },
      "Tags": {"SS": [ "Mental Health" ] },
      "Address": {"S": "4233 W Beltline Hwy\nMadison, WI 53711" },
      "Phone": {"S": "(608) 268-6000" },
      "Fax": {"S": "" },
      "Email": {"S": "nami@namiwisconsin.org" },
      "Website": {"S": "https://namiwisconsin.org/education-programs/for-individuals-with-mental-illness/nami-connection/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Sojourner Family Peace Center" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Shelter" },
      "Description": {"S": "Sojourner Truth House has been in existence since 1978. The 53-bed emergency shelter offers a safe respite for people dealing with domestic violence, sexual assault and human trafficking. Shelter residents and their children are provided with basic necessities such as food, clothing, warmth, security, empathy and support, counseling and support groups, advocacy services and children’s programming.\n\nCall us at 414-933-2722 and take the first step to building a violence-free life." },
      "Tags": {"SS": [ "Housing" ] },
      "Address": {"S": "619 W. WALNUT ST, \nMILWAUKEE, WISCONSIN 53212," },
      "Phone": {"S": "414-276-1911" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://familypeacecenter.org/resources/batterers-intervention-group/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Sojourner Family Peace Center" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Help for Offenders" },
      "Description": {"S": "BATTERERS INTERVENTION SERVICES \nBeyond Abuse programming is available for women who have committed or exhibit violent, abusive or controlling behavior in their marriage or intimate partner relationships and want to put an end to it. The goal of Beyond Abuse is to help participants learn to eliminate violent, abusive and controlling behaviors from their relationships, thus contributing to ending the cycle of domestic violence. \n\nThrough our groups, participants can and do learn alternative, healthy, non-abusive ways to deal with their emotions. \n\nThe Beyond Abuse program consists of weekly, 1 ½ hour sessions that are co-taught by a male and female facilitator. These sessions emphasize: \n\n- Identification of physically abusive behaviors and recognition of other abusive and controlling acts \n- Acceptance of responsibility for one’s own behavior \n- Realization of the destructiveness of these abusive acts \n- Elimination of these destructive acts through the introduction of alternative behaviors \n- Maintenance of the new behaviors through reinforcement and practice \n- Identification of primary emotions and acceptance of emotions as being normal to the human condition \n- Recognition of the difference between emotions, thoughts and actions \n- Developing the skill to cope with feelings through personal thought, reflection and challenge \n- Developing the skill to express and communicate feelings and emotions effectively and non-abusively" },
      "Tags": {"SS": [ "Behavioral Health & Mental Health"] },
      "Address": {"S": "619 W. WALNUT ST, \nMILWAUKEE, WISCONSIN 53212," },
      "Phone": {"S": "414-276-1911" },
      "Fax": {"S": "414-727-2342" },
      "Email": {"S": "" },
      "Website": {"S": "https://familypeacecenter.org/resources/batterers-intervention-group/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Sojourner Family Peace Center" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Support Groups" },
      "Description": {"S": "Our support groups are held in confidential locations and co-taught by two facilitators. Participants will receive information about the following:\nDomestic violence and how to rebuild in its aftermath\nHow to identify typical signs of the effects of domestic violence on children\nThe healing services available for adults and children who have been exposed to domestic violence\nOther available advocacy services and community resources\nHow criminal and civil systems affect participants’ lives\nSafety planning and practical tools to assess whether an abuser is changing\nLogistical support, such as providing for transportation needs\nFor more information, or to join our support groups, please call our Advocacy Office at 414-276-1911 or our 24-hour Domestic Violence Hotline at 414-933-2722." },
      "Tags": {"SS": [ "Mental Health", "Health" ] },
      "Address": {"S": "619 W. WALNUT ST, \nMILWAUKEE, WISCONSIN 53212," },
      "Phone": {"S": "414-276-1911" },
      "Fax": {"S": "414-727-2342" },
      "Email": {"S": "" },
      "Website": {"S": "https://familypeacecenter.org/resources/batterers-intervention-group/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Sojourner Family Peace Center" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Restraining Orders" },
      "Description": {"S": "For assistance filing a restraining order, call Sojourner at (414) 278-5079. Leave a message that includes your full name and a safe call-back number. An Advocate will call back to assist you with filing a TRO online between the hours of 8:00 a.m. – 4:00 p.m., Monday – Friday. The temporary restraining order documents will NOT be effective until reviewed and approved by a court commissioner.\n\nIf you already have filed a restraining order and have an upcoming hearing, report to the Milwaukee County Courthouse, Room 712 on the 7th Floor, at your scheduled time. (Refer to the information on the temporary restraining order paperwork received when you filed.)\n\nFor more information about the hearing and how to prepare, call Sojourner at (414) 278-5079. Leave a message that includes your full name and a safe call-back number. An Advocate will call back between 8:00 a.m. – 4:00 p.m., Monday – Friday to answer your questions about the hearing. Advocates will be on the phone during the hearing to support you and will talk with you after the hearing. If you do not appear to the hearing, the order will be dismissed." },
      "Tags": {"SS": [ "Mental Health", "Health" ] },
      "Address": {"S": "619 W. WALNUT ST, \nMILWAUKEE, WISCONSIN 53212," },
      "Phone": {"S": "414-276-1911" },
      "Fax": {"S": "414-727-2342" },
      "Email": {"S": "" },
      "Website": {"S": "https://familypeacecenter.org/resources/batterers-intervention-group/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Sojourner Family Peace Center" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Case Management" },
      "Description": {"S": "Families affected by violence require additional tools and support to escape their situations and avoid further violence. Sojourner Family Peace Center provides advocacy and in-depth case management services to adult victims of domestic violence.\nCase Management includes:\nHelping victims of domestic violence find and access shelter\nEstablishing safe housing\nFinding child care\nProviding counseling\nMaking referrals for health care\nHelping obtain civil legal services. Through our partnership with Legal Action of Wisconsin, attorneys provide free legal advice and representation.\nServices provided are available in English, Spanish, Hmong and Russian and are free of charge.\n\nTo talk to an Advocate, please call Sojourner Family Peace Center at 414-276-1911 between 8:30 a.m. and 5:00 p.m., Monday through Friday." },
      "Tags": {"SS": [ "Mental Health", "Justice", "Housing" ] },
      "Address": {"S": "619 W. WALNUT ST, \nMILWAUKEE, WISCONSIN 53212," },
      "Phone": {"S": "414-276-1911" },
      "Fax": {"S": "414-727-2342" },
      "Email": {"S": "" },
      "Website": {"S": "https://familypeacecenter.org/resources/batterers-intervention-group/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Sojourner Family Peace Center" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Life Skills" },
      "Description": {"S": "The Life Skills Program at Sojourner encourages self-sufficiency and economic empowerment for victims of domestic violence through an array of services aimed at helping them attain education, training, employment and economic freedom from their abuser. Our programming is comprised of individual and group support, employment readiness training and financial empowerment education designed assist victims of domestic violence in their efforts to achieve self-sufficiency and freedom from abuse.\n\nIn 2014, the program served 355 survivors. Of those, 100% completed a personal empowerment plan, 78% completed a financial education workshop, 73% attended empowerment workshops, 59% received assistance with resume development, 49% received assistance in obtaining housing, 18% were linked to financial services and 16% were linked to employment services.\n\nFor more information, or to join our support groups, please call our Advocacy Office at 414-276-1911 or our 24-hour Domestic Violence Hotline at 414-933-2722." },
      "Tags": {"SS": [ "Employment", "Education" ] },
      "Address": {"S": "619 W. WALNUT ST, \nMILWAUKEE, WISCONSIN 53212," },
      "Phone": {"S": "414-276-1911" },
      "Fax": {"S": "414-727-2342" },
      "Email": {"S": "" },
      "Website": {"S": "https://familypeacecenter.org/resources/batterers-intervention-group/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Sojourner Family Peace Center" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Vine" },
      "Description": {"S": "The Wisconsin VINE system is a service through which victims of crime, law enforcement and interested citizens can use the telephone or internet to search for information regarding the custody status of an offender and to register to receive telephone and email notification when the offender’s custody status changes. The VINE toll-free number for the Wisconsin VINE service is 1-888-944-8463. This service is provided to assist victims and the public, who have a right to know about offenders’ custody status." },
      "Tags": {"SS": [ "Behavioral Health & Mental Health"] },
      "Address": {"S": "619 W. WALNUT ST, \nMILWAUKEE, WISCONSIN 53212," },
      "Phone": {"S": "414-276-1911" },
      "Fax": {"S": "414-727-2342" },
      "Email": {"S": "" },
      "Website": {"S": "https://familypeacecenter.org/resources/batterers-intervention-group/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Sojourner Family Peace Center" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Violence in the Workplace" },
      "Description": {"S": "Employers play an important role in making the workplace safe for victims of domestic violence. A safe work environment includes clear human resource policies, manager training, security, flexible leave and benefit policies and employee education.\nSFPC can help employers with training, policies and provide on-site advocacy if needed. Contact us to discuss how we can partner with you to make your workplace safe for victims of domestic violence to come forward." },
      "Tags": {"SS": [ "Employment", "Behavioral Health & Mental Health"] },
      "Address": {"S": "619 W. WALNUT ST, \nMILWAUKEE, WISCONSIN 53212," },
      "Phone": {"S": "414-276-1911" },
      "Fax": {"S": "414-727-2342" },
      "Email": {"S": "" },
      "Website": {"S": "https://familypeacecenter.org/resources/batterers-intervention-group/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "Sojourner Family Peace Center" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Animal Abuse & Family Violence" },
      "Description": {"S": "Recognizing the link between animal abuse and family violence, Sojourner Family Peace Center and the Wisconsin Humane Society have joined together to offer the Safe Haven Foster Program. Safe Haven provides temporary shelter for pets of domestic violence victims, making it possible for victims to leave a dangerous situation knowing their animal is safe.\n\nSafe Haven offers up to 60 days of shelter for animals of domestic violence victims. Many victims are hesitant to leave a dangerous situation because they fear for their animal’s safety, and this program makes it possible for victims to leave a dangerous situation without losing their companion animal.\n\nIf you know of a family or animal in danger, contact us at 414-933-2722. For more information or to volunteer as a Safe Haven foster parent, call the Wisconsin Humane Society at 414-264-6257." },
      "Tags": {"SS": [ "Behavioral Health & Mental Health", "Health"] },
      "Address": {"S": "619 W. WALNUT ST, \nMILWAUKEE, WISCONSIN 53212," },
      "Phone": {"S": "414-276-1911" },
      "Fax": {"S": "414-727-2342" },
      "Email": {"S": "" },
      "Website": {"S": "https://familypeacecenter.org/resources/batterers-intervention-group/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "UMOS" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Job Center" },
      "Description": {"S": "The UMOS Job Center is the heart of the workforce development division.\nThe UMOS Job Center provides omprehensive employment related programs and direct services, as well as supportive services to help individual job seekers reach their career goals. Over 240,000 job seekers enter through the UMOS Job Center doors every year.\nMeeting the workforce needs of employers is an on-going challenge. Matching the right potential employees with the right potential employers takes time, listening, preparation, screening, skills assessments, coaching, and trust through relationship building. We take pride in making initial job placements with employers, but more pride in successful job retentions.\nOur workforce development division is comprised of 5 major programs: Wisconsin Works (W-2), Transitional Jobs Program, Transform Milwaukee Jobs Program, National Farmworker Jobs Program and TechHire. Each has its own comprehensive wrap-around and supportive services to create a holistic approach to meeting the individual needs of job seekers and employers." },
      "Tags": {"SS": [ "Employment" ] },
      "Address": {"S": "2701 S. Chase Avenue \nMilwaukee, WI. 53207" },
      "Phone": {"S": "" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.umos.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "UMOS" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Tech Hire" },
      "Description": {"S": "Focused on Wisconsin Residents\nHigher levels of skills will be needed to enter the ever emerging and expanding technostaff provided job placement assistance and accelerated technology-based skills training in web development, AutoCAD, HelpDesk and Microsoft Office Suite. Over 100 participants have enrolled.\n\nFocused on Employers\nUMOS TechHire staff develop customized training services to assist in meeting employer demand for a technology skilled workforce. TechHire staff provide a higher level of previously provided workforce development programing to meet the higher skill levels needed by employers.\n\nPilot Program\nUMOS partners with local companies to develop customized training for potential employee prospects with specific needed skills. For example, based on current data, a pilot training module for Computer Numerically Controlled Operators is being explored with a Milwaukee County Corrections Facility to meet the needs of area employers. Starting salaries for ex-offenders that complete the accelerated program before reentering their community could range from $30,000 to $55,000 per year.\n\nEastern Wisconsin TechHire Collaborative\nThe UMOS Eastern Wisconsin TechHire Collaborative, a partnership between UMOS, the College of Menominee Nation, and several employers, is designed to meet the overall workforce demand in technoTechHire program targets ages 17-29, with blended accelerated training, hands-on experience in web and software application development, real-world employer projects, and certification toward industry-recognized credentialing, such as Microsoft certifications.\n\nIndividualized Training Techniques\nUMOS offers various individualized training techniques for maximum participant learning:\n\nVirtual training from any location with an internet connection\nRemote instructional and coaching support\nWeb conferencing\nFace-to-face facilitated training workgroup sessions in the UMOS Technology Center in Milwaukee, Wisconsin\nClassroom instructor-led sessions through collaboration with the College of Menominee Nation in Keshena and Green Bay, Wisconsin." },
      "Tags": {"SS": [ "Employment" ] },
      "Address": {"S": "2701 S. Chase Avenue \nMilwaukee, WI. 53207" },
      "Phone": {"S": "" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.umos.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "UMOS" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Transitional Jobs Program" },
      "Description": {"S": "The UMOS Transform Milwaukee Jobs Program and the UMOS Transitional Jobs Program help participants progress from assistance (subsidized wages) to self-sufficiency (unsubsidized wages). The programs offer unemployed residents immediate work with pay. The programs offer job coaching, employability planning, life skills development, limited vocational training, as well as job search assistance.\n\nEmployers in the for-profit, and non-profit sectors in Milwaukee, Southeastern and Northeastern rural regions in Wisconsin gain access to employable residents through time-limited, publicly funded wages.\n\nSince 2014 the Transform Milwaukee Jobs Program has served over 2250 individuals. Over 90% of program participants are ex-offenders and enrolled in a child support program. Eighty-five percent of the individuals enrolled were placed in subsidized employment.\n\nThe rural Northeastern Transitional Jobs program is operated, in partnership with the Menominee Tribal Enterprise in the Wisconsin Counties of Menominee, Langlade, Forest and Florence. Over 65% of participants were placed in unsubsidized employment.\n\nUMOS recently received $1.5 million in additional funds to expand, in partnership with the Ho-Chunk Nation, into the rural South-Central Wisconsin areas of Juneau, Adams, Jackson, and Clark Counties.\n\nThe UMOS Transform Milwaukee Jobs Program and Transitional Jobs Program are funded by the Wisconsin Department of Children and Families." },
      "Tags": {"SS": [ "Employment" ] },
      "Address": {"S": "2701 S. Chase Avenue \nMilwaukee, WI. 53207" },
      "Phone": {"S": "" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.umos.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
      "Label": {"S": "UMOS" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Wisconsin Works (W-2)" },
      "Description": {"S": "UMOS is the only non-profit organization that is contracted to operate the W-2 program in Milwaukee, Wisconsin. The other W-2 contracted operators are larger, for-profit corporations.\nFor the fifth consecutive year UMOS had the most approvals in the state for helping individuals obtain disability benefits from the Social Security Administration.\nUMOS staff served 2,571 W-2 participants, with 956 placed into employment, earning an average of $10.39 per hour. Participants entered the customer sercare, retail sales and food service, to name a few.\nFour-hundred sixty-seven clients have remained on the job for 90 days or more.\nThe goal of the UMOS W-2 program is to build on the strengths and skills of job seekers. UMOS continued to provide services that are strength-based, family-centered, employer focused, yet consistent with job seekers’ interests and goals.\nAlthough UMOS has operated the W-2 program since its inception in 1997, UMOS staff continue to look for new and innovative methods to improve participant outcomes. UMOS is the only W-2 agency that has a partnership with the University of Wisconsin-Milwaukee Helen Bader School of Social Welfare to implement a trauma informed case management service.\nUMOS continues to believe in a comprehensive approach to workforce development, substantial employer engagement, deep community connections, career advancement, human services support, and industry-driven education and training.\nThe W-2 Program is funded by the Wisconsin Department of Children and Families." },
      "Tags": {"SS": [ "Employment" ] },
      "Address": {"S": "2701 S. Chase Avenue \nMilwaukee, WI. 53207" },
      "Phone": {"S": "" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.umos.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "UMOS" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"National Farmworker Jobs Program (NFJP)" },
      "Description": {"S": "The National Farmworker Jobs Program is a national program created by congress in response to the chronic seasonal unemployment and underemployment experienced by migrant and seasonal farmworkers.\n\nWIOA-167/NFJP offers Career and Training Services that may help you enroll into a short-term training or college program and pay for class tuition. You may even receive a stipend while enrolled in school. We can also assist with books, lodging, fees, work-related equipment, and other needs. Veterans receive priority services. UMOS operates the program in Missouri and Wisconsin." },
      "Tags": {"SS": [ "Employment" ] },
      "Address": {"S": "2701 S. Chase Avenue \nMilwaukee, WI. 53207" },
      "Phone": {"S": "" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.umos.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "UMOS" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Adult Basic Education" },
      "Description": {"S": "UMOS continued to provide GED classroom instruction and testing services to high school students and members of the community seeking more education for more economic opportunities. UMOS graduated 146 students in 2017, a 21% increase over 2016.\n\nUMOS continued to be the main testing services center for Milwaukee's southside community and the testing center of choice for Milwaukee Public Schools. UMOS provided GED testing services to 1223 students in 2017, versus 1008 in 2016, plus an additional 284 professional tests.\n\nOverall, the UMOS Pearson Vue GED Test Center ranked 4th out of 129 test centers in Wisconsin, based on total exams taken in 2017.\n\nUMOS also provided English as a Second Language (ESL) classes to job seekers and other members of the community from around the world. GED and ESL services are located within the UMOS Job Center." },
      "Tags": {"SS": [ "Education", "Employment" ] },
      "Address": {"S": "2701 S. Chase Avenue \nMilwaukee, WI. 53207" },
      "Phone": {"S": "" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.umos.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "UMOS" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Child Care Drop Off Services" },
      "Description": {"S": "The UMOS Child Care Drop Off Center is located within the UMOS Job Center and is open Monday – Friday, 8 a.m. to 5 p.m. W-2 Job seekers and other program participants can temporarily drop off their children while taking advantage of resources in the UMOS Job Center.\n\nA snack is provided to children while they take advantage of educational programs, computers and art activities. The UMOS Child Care Drop Off Center served 3,709 children from July 2017, through May 2018." },
      "Tags": {"SS": [ "Employment" ] },
      "Address": {"S": "2701 S. Chase Avenue \nMilwaukee, WI. 53207" },
      "Phone": {"S": "" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.umos.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Pathfinders" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Positive Youth Development" },
      "Description": {"S": "At Pathfinders, we are committed to enabling a ladder of opportunity for young people. We value youth as vital assets to both our organization and community. We consider them to be partners and decision-makers in the services they receive, honoring their voices." },
      "Tags": {"SS": [ "Youth" ] },
      "Address": {"S": "Pathfinders Main Office\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Southeastern Education Center\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Youth Shelter\n1614 E Kane Pl.\nMilwaukee, WI 53202" },
      "Phone": {"S": "Pathfinders Main Office\n(414)964-2565\n\nPathfinders Southeastern Education Center\n(414)875-9452\n\nPathfinders Youth Shelter\n(414)271-1560" },
      "Fax": {"S": "Pathfinders Main Office\n(414)964-0102\n\nPathfinders Southeastern Education Center\n(414)875-9004\n\nPathfinders Youth Shelter\n(414)271-1831" },
      "Email": {"S": "info@pathfindersmke.org" },
      "Website": {"S": "https://www.pathfindersmke.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Pathfinders" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Trauma Informed Care" },
      "Description": {"S": "We use individualized therapeutic approaches to reduce the effects of trauma on current and future life experiences. From a foundation of increased mental wellness and healthy coping skills, youth can engage more effectively in working towards their self-identified goals." },
      "Tags": {"SS": [ "Behavioral Health & Mental Health" ] },
      "Address": {"S": "Pathfinders Main Office\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Southeastern Education Center\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Youth Shelter\n1614 E Kane Pl.\nMilwaukee, WI 53202" },
      "Phone": {"S": "Pathfinders Main Office\n(414)964-2565\n\nPathfinders Southeastern Education Center\n(414)875-9452\n\nPathfinders Youth Shelter\n(414)271-1560" },
      "Fax": {"S": "Pathfinders Main Office\n(414)964-0102\n\nPathfinders Southeastern Education Center\n(414)875-9004\n\nPathfinders Youth Shelter\n(414)271-1831" },
      "Email": {"S": "info@pathfindersmke.org" },
      "Website": {"S": "https://www.pathfindersmke.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Pathfinders" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Housing First Model" },
      "Description": {"S": "We believe that housing is a right, not a privilege. We employ a Housing First model where we secure safe housing for young people in crisis as quickly as possible. We know that housing is an essential tool for stability. Once housed, Pathfinders provides our youth with comprehensive services that will help them find success.\n\nSupported Housing \nPathfinders helps homeless and housing insecure youth find and sustain safe housing. Once housed, we offer support to youth as they work towards stability, mental well-being, education, employment and other personal goals. \nOur programs offer supported housing services that are individualized to the needs of each young person. We place a particular emphasis on serving LGBTQ+-identified youth, chronically homeless youth, youth with disabilities, youth with mental health challenges and youth aging out of foster care." },
      "Tags": {"SS": [ "Housing", "Behavioral Health & Mental Health"] },
      "Address": {"S": "Pathfinders Main Office\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Southeastern Education Center\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Youth Shelter\n1614 E Kane Pl.\nMilwaukee, WI 53202" },
      "Phone": {"S": "Pathfinders Main Office\n(414)964-2565\n\nPathfinders Southeastern Education Center\n(414)875-9452\n\nPathfinders Youth Shelter\n(414)271-1560" },
      "Fax": {"S": "Pathfinders Main Office\n(414)964-0102\n\nPathfinders Southeastern Education Center\n(414)875-9004\n\nPathfinders Youth Shelter\n(414)271-1831" },
      "Email": {"S": "info@pathfindersmke.org" },
      "Website": {"S": "https://www.pathfindersmke.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Pathfinders" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Evidence Based Frameworks" },
      "Description": {"S": "We invest in researching and training staff on nationally-certified, best-practice models. We do this because we want to utilize methods that are proven to work. We collaborate with higher education institutions and partner organizations throughout our community as much as possible to promote our innovative and evidence-based approaches." },
      "Tags": {"SS": [ "" ] },
      "Address": {"S": "Pathfinders Main Office\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Southeastern Education Center\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Youth Shelter\n1614 E Kane Pl.\nMilwaukee, WI 53202" },
      "Phone": {"S": "Pathfinders Main Office\n(414)964-2565\n\nPathfinders Southeastern Education Center\n(414)875-9452\n\nPathfinders Youth Shelter\n(414)271-1560" },
      "Fax": {"S": "Pathfinders Main Office\n(414)964-0102\n\nPathfinders Southeastern Education Center\n(414)875-9004\n\nPathfinders Youth Shelter\n(414)271-1831" },
      "Email": {"S": "info@pathfindersmke.org" },
      "Website": {"S": "https://www.pathfindersmke.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Pathfinders" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Youth Led Programming" },
      "Description": {"S": "Our young people access services and support at Pathfinders, and also give the same to their peers. Youth have the most important say in the services we provide and how we run our agency. We strive to grow leaders from within through opportunities such as our youth leadership councils, youth-led programming and volunteer and employment opportunities." },
      "Tags": {"SS": [ "Employment", "Youth" ] },
      "Address": {"S": "Pathfinders Main Office\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Southeastern Education Center\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Youth Shelter\n1614 E Kane Pl.\nMilwaukee, WI 53202" },
      "Phone": {"S": "Pathfinders Main Office\n(414)964-2565\n\nPathfinders Southeastern Education Center\n(414)875-9452\n\nPathfinders Youth Shelter\n(414)271-1560" },
      "Fax": {"S": "Pathfinders Main Office\n(414)964-0102\n\nPathfinders Southeastern Education Center\n(414)875-9004\n\nPathfinders Youth Shelter\n(414)271-1831" },
      "Email": {"S": "info@pathfindersmke.org" },
      "Website": {"S": "https://www.pathfindersmke.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Pathfinders" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Harm Reduction" },
      "Description": {"S": "A non-judgmental approach where the primary goal is to reduce the likelihood of harm to youth. Harm reduction methods include a spectrum of services and strategies that help support youth’s safety and reinforce positive changes while maintaining individual dignity and autonomy." },
      "Tags": {"SS": [ "Behavioral Health & Mental Health", "Youth"] },
      "Address": {"S": "Pathfinders Main Office\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Southeastern Education Center\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Youth Shelter\n1614 E Kane Pl.\nMilwaukee, WI 53202" },
      "Phone": {"S": "Pathfinders Main Office\n(414)964-2565\n\nPathfinders Southeastern Education Center\n(414)875-9452\n\nPathfinders Youth Shelter\n(414)271-1560" },
      "Fax": {"S": "Pathfinders Main Office\n(414)964-0102\n\nPathfinders Southeastern Education Center\n(414)875-9004\n\nPathfinders Youth Shelter\n(414)271-1831" },
      "Email": {"S": "info@pathfindersmke.org" },
      "Website": {"S": "https://www.pathfindersmke.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Pathfinders" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Runaway and Homeless Youth Services" },
      "Description": {"S": "Pathfinders offers a wide array of comprehensive services that support our youth’s immediate safety and long-term well-being.\n\nDrop-In Center \nOur welcoming and inclusive Drop-In Center meets youth’s basic needs for food, clothing, laundry, showers, hygiene resources and safe social spaces. We also provide case management, employment and education support, sexual health and wellness education and mental health services.\n\nStreet Outreach \nWe operate Milwaukee’s only youth-focused Street Outreach team. With our mobile resource center, we meet youth where they are and share resources, basic needs items, sexual and mental wellness education, and referrals to aid their safe exit from the streets. By bringing our resources to the streets, we remove barriers to accessing services and build trusting relationships with young people in their neighborhoods. \n\nYouth Shelter \nPathfinders’ Youth Shelter is open 365 days a year and provides emergency short-term shelter for adolescents aged 11-17, plus crisis counseling services for youth aged 18-21. We operate one of only two state-licensed youth shelters serving Milwaukee, representing half of the available beds in the city for youth. During and after their Shelter stay, we offer youth intensive counseling, case management and basic needs services that help them maintain safety and stability. \n\n" },
      "Tags": {"SS": [ "Youth", "Housing", "Mental Health", "Employment", "Sexual Health", "Education Support" ] },
      "Address": {"S": "Pathfinders Main Office\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Southeastern Education Center\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Youth Shelter\n1614 E Kane Pl.\nMilwaukee, WI 53202" },
      "Phone": {"S": "Pathfinders Main Office\n(414)964-2565\n\nPathfinders Southeastern Education Center\n(414)875-9452\n\nPathfinders Youth Shelter\n(414)271-1560" },
      "Fax": {"S": "Pathfinders Main Office\n(414)964-0102\n\nPathfinders Southeastern Education Center\n(414)875-9004\n\nPathfinders Youth Shelter\n(414)271-1831" },
      "Email": {"S": "info@pathfindersmke.org" },
      "Website": {"S": "https://www.pathfindersmke.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Pathfinders" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Anti-Sexual and Violence Services" },
      "Description": {"S": "Pathfinders serves young people who are at high risk of sexual abuse, exploitation and trafficking. We work with youth who frequently find themselves at the intersection of sexual violence and homelessness. In addition to providing direct services for youth experiencing sexual violence, our Anti-Sexual Violence team places great emphasis on raising community awareness and ensuring that youth with lived experience have a platform to influence systems change. \n\nHand-in-Hand \nPathfinders’ Hand-in-Hand program provides comprehensive group, family and individual counseling for youth under 18 who have experienced sexual abuse. Hand-in-Hand uses trauma-informed therapeutic approaches to help young people understand their individual reactions to trauma, what triggers these reactions and coping strategies that they can use to heal. \n\nNew Paths \nWorking specifically with youth and young adults aged 11-25 who have experienced sexual exploitation and trafficking, New Paths offer accompaniment and advocacy services for youth as they navigate medical, legal and social service systems. "},
      "Tags": {"SS": [ "Youth", "Sexual Health", "Mental Health", "Medical Health", "Legal and Social Services" ] },
      "Address": {"S": "Pathfinders Main Office\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Southeastern Education Center\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Youth Shelter\n1614 E Kane Pl.\nMilwaukee, WI 53202" },
      "Phone": {"S": "Pathfinders Main Office\n(414)964-2565\n\nPathfinders Southeastern Education Center\n(414)875-9452\n\nPathfinders Youth Shelter\n(414)271-1560" },
      "Fax": {"S": "Pathfinders Main Office\n(414)964-0102\n\nPathfinders Southeastern Education Center\n(414)875-9004\n\nPathfinders Youth Shelter\n(414)271-1831" },
      "Email": {"S": "info@pathfindersmke.org" },
      "Website": {"S": "https://www.pathfindersmke.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Pathfinders" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Education" },
      "Description": {"S": "Pathfinders operates the Southeastern Education Center, a Milwaukee Public School contracted behavioral reassignment middle school. The Southeastern Education Center works with students who have been challenged in traditional school settings and are in need of individualized educational support. Our trauma-informed approach to education provides access to mental health and wraparound services with the goal of scholars returning to their school of origin." },
      "Tags": {"SS": [ "Mental Health", "Education", "Youth" ] },
      "Address": {"S": "Pathfinders Main Office\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Southeastern Education Center\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Youth Shelter\n1614 E Kane Pl.\nMilwaukee, WI 53202" },
      "Phone": {"S": "Pathfinders Main Office\n(414)964-2565\n\nPathfinders Southeastern Education Center\n(414)875-9452\n\nPathfinders Youth Shelter\n(414)271-1560" },
      "Fax": {"S": "Pathfinders Main Office\n(414)964-0102\n\nPathfinders Southeastern Education Center\n(414)875-9004\n\nPathfinders Youth Shelter\n(414)271-1831" },
      "Email": {"S": "info@pathfindersmke.org" },
      "Website": {"S": "https://www.pathfindersmke.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Pathfinders" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Clinical Services" },
      "Description": {"S": "Our team of care coordinators offers support to youth living with mental health and/or substance use diagnoses to reduce negative symptoms, develop life skills and transition into adulthood. Using a harm-reduction approach, Pathfinders encourages healthy relationships, self-identified goals and self-empowerment." },
      "Tags": {"SS": [ "Mental Health" ] },
      "Address": {"S": "Pathfinders Main Office\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Southeastern Education Center\n4200 N Holton St. Suite 400\nMilwaukee, WI 53212\n\nPathfinders Youth Shelter\n1614 E Kane Pl.\nMilwaukee, WI 53202" },
      "Phone": {"S": "Pathfinders Main Office\n(414)964-2565\n\nPathfinders Southeastern Education Center\n(414)875-9452\n\nPathfinders Youth Shelter\n(414)271-1560" },
      "Fax": {"S": "Pathfinders Main Office\n(414)964-0102\n\nPathfinders Southeastern Education Center\n(414)875-9004\n\nPathfinders Youth Shelter\n(414)271-1831" },
      "Email": {"S": "info@pathfindersmke.org" },
      "Website": {"S": "https://www.pathfindersmke.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Project Return" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Employment Services" },
      "Description": {"S": "Finding stable employment is a priority to most people returning from incarceration. Employment provides purpose as well as an income. Project RETURN helps our clients with their employment search. Whether it be discussing employment goals to creating a resume to finding job leads to preparing individuals for interviews, Project RETURN walks with each individual on this path to self-sustainability. \n\nAlong the way, Project RETURN assists clients with clothing, specialty work tools, transportation, and employment training opportunities. All this is done on an individual basis to help the individual get from where they are to where they want to be." },
      "Tags": {"SS": [ "Employment" ] },
      "Address": {"S": "2821 Vel R Phillips Ave, Suite 223\nMilwaukee, WI 53212\n\nOffice Hours\n8:30am to 5:00pm\nMonday to Friday" },
      "Phone": {"S": "(414) 374-8029" },
      "Fax": {"S": "(414) 374-8033" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.projectreturnmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Project Return" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Alcohol and Other Drug Abuse (AODA) Counselling" },
      "Description": {"S": "Project RETURN offers three AODA Support Groups on a weekly basis. Two of these groups (Tuesdays 5:30-7:00 and Fridays 6:00 to 7:30) are held at our offices while the third group is held at a minimum security prison in Milwaukee. These groups are all facilitated by Clem Richardson, a Certified Substance Abuse Counselor with over two decades of experience providing AODA treatment and support counseling. \n\nIndividuals can be referred into the program by the Department of Corrections or self-refer themselves into the group. To enroll, please contact Teri Woodley at our offices" },
      "Tags": {"SS": [ "Behavioral Health & Mental Health", "Substance Abuse Support Group"] },
      "Address": {"S": "2821 Vel R Phillips Ave, Suite 223\nMilwaukee, WI 53212\n\nOffice Hours\n8:30am to 5:00pm\nMonday to Friday" },
      "Phone": {"S": "(414) 374-8029" },
      "Fax": {"S": "(414) 374-8033" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.projectreturnmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Project Return" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Housing" },
      "Description": {"S": "A major issue facing individuals returning from incarceration is housing. Too many people return home only to find they don’t know where that is. Project RETURN works with landlords to open up housing opportunities to our clients who are in need." },
      "Tags": {"SS": [ "Housing" ] },
      "Address": {"S": "2821 Vel R Phillips Ave, Suite 223\nMilwaukee, WI 53212\n\nOffice Hours\n8:30am to 5:00pm\nMonday to Friday" },
      "Phone": {"S": "(414) 374-8029" },
      "Fax": {"S": "(414) 374-8033" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.projectreturnmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Project Return" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Circles of Support" },
      "Description": {"S": "In 2018 Project RETURN added a new element to our programming—one that has been proven to reduce recidivism rates in other communities both in the U.S. and in Canada. Circles of Support are small groups that meet regularly to provide a stable, supportive network to men and women returning from incarceration. \n\n​Members of each circle include formerly incarcerated people, a trained circle keeper, and community volunteers. Through a structured process, members grow with each other, learn from one another, and help the community heal from the trauma experienced through poverty and crime. \n\nCircles have started at three locations: St. Ben’s Parish, Project RETURN’s offices, and Hephatha Lutheran Church. Additional sites have expressed interest in hosting circles in 2019." },
      "Tags": {"SS": [ "Behavioral Health & Mental Health", "Circle of Support"] },
      "Address": {"S": "2821 Vel R Phillips Ave, Suite 223\nMilwaukee, WI 53212\n\nOffice Hours\n8:30am to 5:00pm\nMonday to Friday" },
      "Phone": {"S": "(414) 374-8029" },
      "Fax": {"S": "(414) 374-8033" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.projectreturnmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Project Return" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Alumni Support Group" },
      "Description": {"S": "The Alumni Support Group meets every Tuesday at 5:00 pm. This is a re-entry support group facilitated and attended by those who have experienced incarceration and extended supervision. The purpose of this group is to address the immediate needs of each participant in a safe and supportive atmosphere. \n\n​Too often those returning from incarceration do not have a positive support network and do not know who they can express the struggles they are facing. The Alumni Group provides that supportive atmosphere that is sorely lacking in many people’s lives." },
      "Tags": {"SS": [ "Behavioral Health & Mental Health", "Support Group"] },
      "Address": {"S": "2821 Vel R Phillips Ave, Suite 223\nMilwaukee, WI 53212\n\nOffice Hours\n8:30am to 5:00pm\nMonday to Friday" },
      "Phone": {"S": "(414) 374-8029" },
      "Fax": {"S": "(414) 374-8033" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.projectreturnmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Project Return" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Women's Support Group" },
      "Description": {"S": "Similar, to the Alumni Group, The Women’s Support Group focuses entirely on issues facing women who have returned from incarceration. Women face unique issues, often in silence. The Women’s Support Group is held every Tuesday afternoon with a meal beginning at 12:30 pm." },
      "Tags": {"SS": [ "Women Support Group", "Behavioral Health & Mental Health"] },
      "Address": {"S": "2821 Vel R Phillips Ave, Suite 223\nMilwaukee, WI 53212\n\nOffice Hours\n8:30am to 5:00pm\nMonday to Friday" },
      "Phone": {"S": "(414) 374-8029" },
      "Fax": {"S": "(414) 374-8033" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.projectreturnmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Project Return" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Outreach Efforts" },
      "Description": {"S": "Project RETURN takes the services outlined above into the community to work with faith communities and other civic organizations. This is important as there are many natural and perceived boundaries in Milwaukee that impede the individual to make it to our offices. By coming into the community, Project RETURN and the host sites show that they are committed to re-entry and in helping the individual to become a success." },
      "Tags": {"SS": [ "Re-entry", "Outreach"] },
      "Address": {"S": "2821 Vel R Phillips Ave, Suite 223\nMilwaukee, WI 53212\n\nOffice Hours\n8:30am to 5:00pm\nMonday to Friday" },
      "Phone": {"S": "(414) 374-8029" },
      "Fax": {"S": "(414) 374-8033" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.projectreturnmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Project Return" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Advocacy" },
      "Description": {"S": "Project RETURN is also active in advocacy efforts in an attempt to open more opportunities for our clients to be successful. Many times this comes in the form of advocacy for policy change in various government institutions. Project RETURN has partnered with many community based organizations to create positive change in our community for those who have experienced incarceration." },
      "Tags": {"SS": [ "Advocacy" ] },
      "Address": {"S": "2821 Vel R Phillips Ave, Suite 223\nMilwaukee, WI 53212\n\nOffice Hours\n8:30am to 5:00pm\nMonday to Friday" },
      "Phone": {"S": "(414) 374-8029" },
      "Fax": {"S": "(414) 374-8033" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.projectreturnmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "City of Milwaukee \n\nMilwaukee Health Department-\n" },
      "Type": {"S": "Govt. Org." },
      "Program and Services": {"S":"Office of Violence Prevention \n" },
      "Description": {"S": "Our core mission is to reduce violence in Milwaukee. The Office of Violence Prevention provides strategic direction and oversight for City efforts to reduce risk of violence through linked strategies in partnership with government, non-profit, neighborhood, and faith organizations.\n\nLearn About Our Work\n\nCommission on Domestic Violence and Sexual Assault\nThe Commission coordinates the community's response to domestic violence and sexual assault by promoting collaboration among law enforcement, victims' advocates, the justice system, health care providers, and policy makers.\n\nHuman Trafficking Task Force of Greater Milwaukee\nThe City of Milwaukee serves as a partner agency on this local effort to improve our community's response to human trafficking.\n\nGun Violence Prevention\nWe're advancing local and national efforts to reduce gun violence and access to illegal guns.\n\nWhy take a Public Health Approach to Violence?\nEach year, millions of individuals, families, and communities bear the physical, mental, and economic costs of violence. As a leading cause of injury, disability, and premature death, this issue compromises health and safety. Merely witnessing violent incidents can result in psychological disorders, such as depression, anxiety, and stress. Violence discourages economic development in troubled areas, thereby affecting the accessibility of jobs, healthy food, and safe housing. The physical wellbeing of residents, who stay indoors to avoid violent behavior in their community, can exacerbate health problems.\n\nFortunately, violence is a learned behavior and is preventable.\n\nThe public health approach uses a four-pronged framework to investigate, understand, and address violence by:\n\nDefining the nature and scope of the violence problem through data collection\nResearching why violence occurs, who it affects, risk and protective factors, and other influences that can be impacted through intervention strategies\nDesigning, implementing, and evaluating violence prevention strategies\nEnsuring widespread adoption of evidence-based practices on an individual, family, community, and societal level\nOur aim is to stop violence before it starts. Community-wide prevention is the most effective, long-term solution to violence, and the Office of Violence Prevention engages a wide range of partners to facilitate a multidisciplinary, population-level approach to influence the social, behavioral, and environmental factors that contribute to violence. The Office of Violence Prevention brings together agencies, experts, and community resources on efforts that reduce:\n\nDomestic and Intimate Partner Violence\nSexual Assault\nChild Abuse\nHuman Trafficking\nChildren Witness to Violence\nCommunity Violence\nGun Violence\nInterpersonal Violence, Intentional injury, and Homicide\nOur office also integrates prevention activities throughout Milwaukee Health Department programs for injuries not caused by violence." },
      "Tags": {"SS": [ "VIolence Prevention", "Health", "Behavioral Health & Mental Health", "Gun Violence Prevention", "Domestic and Intimate Partner Violence", "Sexual Assault", "\nChild Abuse", "Human Trafficking", "Children Witness to Violence", "Community Violence", "Gun Violence", "Interpersonal Violence", "Intentional injury", "Homicide"] },
      "Address": {"S": "Milwaukee Health Department Frank P. Zeidler Municipal Building 841 North Broadway, 3rd Floor Milwaukee, Wisconsin 53202" },
      "Phone": {"S": "(414) 286-8553" },
      "Fax": {"S": "" },
      "Email": {"S": "Reggie Moore\nDirector, Office of Violence Prevention\n\nReggie.Moore@milwaukee.gov" },
      "Website": {"S": "https://city.milwaukee.gov/health/staysafe#.XoFnAYhKjD4" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "City of Milwaukee \n\nMilwaukee Health Department-\n" },
      "Type": {"S": "Govt. Org." },
      "Program and Services": {"S":"Men's Health Center" },
      "Description": {"S": "The City of Milwaukee Health Department offers a one-stop shop for Milwaukee’s men. We give assistance and referrals for a broad range of issues, from blood pressure to housing. A Public Health Nurse is available to deliver health promoting check-ups to individuals and prevention education to groups. The Men’s Health Centers provide resources to help men access assistance and live longer healthier lives.\n\nWhy is Men's Health Important? \nMen in Milwaukee have higher rates of heart disease, cancer-related deaths, homicide, and suicide as compared to Milwaukee women, Wisconsin men, and men in the US.1-8 \n\nMen in Milwaukee are twice as likely to lack healthcare coverage as compared to women in Milwaukee, and over 60% more likely to lack healthcare coverage as compared to Wisconsin men.2,9 \n\nSome 46.8% of working-age Milwaukee-area black males were not in the labor force last year, according to the Center for Economic Development at the University of Wisconsin-Milwaukee. That compares with 17.9% of white men and 22.7% of Hispanic men, based on data from the U.S. Census Bureau's American Community Survey. \n\nThese differences point to men’s health as a priority area in preventing illness, injury, and early death in Milwaukee. \n\nFor details on the references noted above, click here. \n\nWhat Services are provided at the Men’s Health Center? \nHealth Checks including blood pressure, weight, & height (when Public Health Nurse available) \n\nService needs assessments \n\nInformation to help men quit smoking \n\nGuidance and assistance to enroll in state health benefits programs \n\nReferrals to community partners for drug & alcohol counseling, medical care, housing assistance, job information, fatherhood programs, and other services aimed at helping men \n\nWho is eligible? \nAny Milwaukee male age 14 and older. Insurance is not required. \n\n" },
      "Tags": {"SS": [ "Health" ] },
      "Address": {"S": "The Men’s Health Center is open at the following times and locations:\n\nKeenan Health Center, 3200 North 36th Street\nMondays from 11:30am to 4:45pm\nTuesdays, Wednesdays and Fridays from 8:00 am to 4:15 pm\nThursdays from 12:30pm to 7 pm*\n\nNorthwest Health Center, 7630 West Mill Road\nMondays from 8:15am to 4:pm*\nWednesdays from noon to 3pm*\nThursdays from 11am to 4pm\nTuesdays, and Fridays from 8:00 am to 4pm*\n\n*denotes days and locations when Public Health Nurse is available" },
      "Phone": {"S": "Call 414-286-6756 with questions or to set up an appointment." },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "City of Milwaukee \n\nMilwaukee Health Department-\n" },
      "Type": {"S": "Govt. Org." },
      "Program and Services": {"S":"Communicable Disease Prevention and Control" },
      "Description": {"S": "The Communicable Disease Program (CD) helps to assure the health of City of Milwaukee through surveillance, investigation, prevention, and reporting of conditions of public health concern. More than 80 conditions are reportable to public health in Wisconsin resulting in over 15,000 cases reports annually. Program staff investigate a subset of these cases to verify diagnosis, confirm treatment, determine the source of the illness, reinforce medical advice, provide contact notification as necessary, and provide education to prevent further spread of infection. Hundreds of case investigations are performed annually. In addition, disease trends are monitored in order to identify and respond to clusters or outbreaks. The CD program also serves as a resource for the general public, schools and day cares as well as community and medical entities regarding infectious diseases, infection control and prevention." },
      "Tags": {"SS": [ "Health", "Communicable Disease Prevention & Control"] },
      "Address": {"S": "Milwaukee Health Department Frank P. Zeidler Municipal Building 841 North Broadway, 3rd Floor Milwaukee, Wisconsin 53202" },
      "Phone": {"S": "" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://city.milwaukee.gov/health/Communicable-Disease-Control-Program.htm#.XoF4qIhKjD4" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "City of Milwaukee \n\nMilwaukee Health Department-\n" },
      "Type": {"S": "Govt. Org." },
      "Program and Services": {"S":"Tubercolosis Prevention and Care Program" },
      "Description": {"S": "Clinic Overview \nThe Tuberculosis Prevention and Care (TBPC) Program controls tuberculosis (TB) by assuring that all cases of disease and infection are adequately treated. In addition, TBPC does extensive contact investigations that help stop the spread of TB. TBPC relies on protocols developed specifically for TBPC, as well as recommendations from authorities such as the Centers for Disease Control (CDC) and the American Thoracic Society (ATS). To learn more from these authorities, please visit them at www.cdc.gov and www.thoracic.org. \n\nReferrals accepted from health care providers, labs, AODA programs, the Health department, and the community." },
      "Tags": {"SS": [ "Health", "Tuberculosis Prevention and Care" ] },
      "Address": {"S": "TBPC Clinic Hours\nMonday & Thursday 11:00 a.m. - 4:30 p.m and 5:00 p.m. - 6:30 p.m.\nTuesday, Wednesday, & Friday 8:00 a.m. - 11:30 a.m. and 12:45 p.m. - 4:15 p.m." },
      "Phone": {"S": "For an appointment or additional information, call (414) 286-8630." },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://city.milwaukee.gov/health/TB-Prevention-Care#.XoF3c4hKjD4" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "City of Milwaukee \n\nMilwaukee Health Department-\n" },
      "Type": {"S": "Govt. Org." },
      "Program and Services": {"S":"Substance MIsuse and Injury Prevention" },
      "Description": {"S": "Substance Misuse: The World Health Organization (WHO) defines substance misuse as “...the harmful or hazardous use of psychoactive substances, including alcohol and illicit drugs.”\n\nThe most common types of substance use disorders in the U.S. include:\n\nTobacco\nMarijuana\nOpioids\nAlcohol\n\nOverdose Deaths in Milwaukee\nMilwaukee County, specifically the City of Milwaukee has been seeing an increase in overdose deaths attributed to heroin and opioid usage. \n\nThe City of Milwaukee Health Department has teamed with the City County Heroin Opioid Cocaine Task Force, the Milwaukee Fire Department, Milwaukee County Substance Abuse and Prevention (MCSAP) coalition, and many others to tackle this issue.\n\nClick here for more information on heroin \n\nThe Medical College of Wisconsin (MCW), Community Opioid Prevention Effort (COPE) reports on the Milwaukee County opioid crisis, with data from 2012-2018. For the full report, click here. https://city.milwaukee.gov/ImageLibrary/Groups/healthAuthors/SA-Prevention/Opioids/PDF/MilwaukeeCountyOpioid-RelatedOverdoseReport_v6_Final.pdf \n\nSubstance Abuse Related Complaints\nTo report any tobacco use in a restricted area, click here \nhttps://city.milwaukee.gov/health/Substance-Abuse-and-Injury-Prevention/Tobacco.htm#.XoF5bYhKjD4\n\nTo report any needles in your community, click here\nhttps://city.milwaukee.gov/Health/Health-Information/Substance-Abuse-and-Injury-Prevention/Opioids/Heroin-.htm#.XoF5fYhKjD4" },
      "Tags": {"SS": [ "Health" ] },
      "Address": {"S": "Milwaukee Health Department Frank P. Zeidler Municipal Building 841 North Broadway, 3rd Floor Milwaukee, Wisconsin 53202" },
      "Phone": {"S": "" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://city.milwaukee.gov/health/Substance-Abuse-and-Injury-Prevention.htm#.XoF5kYhKjD4" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "City of Milwaukee \n\nMilwaukee Health Department-\n" },
      "Type": {"S": "Govt. Org." },
      "Program and Services": {"S":"Community Healthcare Access" },
      "Description": {"S": "For years, CHAP employees have been dedicated to assisting community members in accessing the health care coverage they need. Today, CHAP can help all community members determine their options under the Affordable Care Act by evaluating whether they qualify for free or low-cost health insurance, or helping them find a health insurance plan that fits their needs and their budget.\n\n\nServices are available in Spanish, Lao, Thai, and Hmong. If you need assistance in a language other than Spanish, Lao, Thai, or Hmong, please contact us today and we will make an appointment with a translator.\n\nWhat programs can the Community Healthcare Access Program assist me in applying for?\nCHAP employees are Certified Application Counselors under the Affordable Care Act, meaning they are trained to assist you in enrolling under the new health care law, the Affordable Care Act (ACA). While the ACA provides new health coverage options for qualified individuals, CHAP will help you every step of the way to determine what programs and services you qualify for, or what low-cost plans are available to you.\n\nCHAP can help you determine if you qualify for:\n\nHealth Insurance Marketplace (private insurance)\nBadgerCare (Medicaid)\nFamily Planning Waiver\nSenior Care\nTitle 19\nExpress Enrollment for pregnant women and children\nCHAP can also assist in enrollment or provide referrals for enrollment in FoodShare, WIC, energy assistance, tax preparation, dental services, and free and sliding-fee clinics.\n\n\nIf you have questions, call (414) 286-8620.\n\nSupport in more than 150 languages is available 24 hours a day at: www.healthcare.gov or 1-800-318-2596.\n\nTo find an enrollment site near you, Milwaukee County residents can also call 2-1-1 for assistance.\n\nHow will the Affordable Care Act (Health Care Reform) affect me?\nToday, thanks to the Affordable Care Act (ACA), there are more options than ever for individuals and families to obtain affordable health insurance.\nImportant things you need to know are:\n\nEffective January 1, 2014, everyone (with few exceptions) is required by law to have health insurance, or pay a fine. Under the new law, everyone can get health insurance, even if you have a pre-existing condition.\nEach year during an open enrollment period, you can begin accessing the Health Insurance Marketplace – a website where you can sign up for affordable insurance plans approved by the federal government. There will be many different health insurance plans with different costs to choose from.\nThe Health Insurance Marketplace (www.healthcare.gov) is one application that determines if you are eligible for other programs, such as Medicaid/BadgerCare.\nIf you are currently covered under Medicaid/BadgerCare, you may receive a letter stating that you have to enroll for coverage through the Health Insurance Marketplace. If you receive this letter, it is very important to act or you may lose your health insurance coverage.\nIf you are covered under Medicare (disabled or 65 and older), your insurance coverage does NOT change, and you do NOT need to go to the Health Insurance Marketplace for coverage.\nMany people will qualify for assistance to help pay for their health insurance through government subsidies. To determine if you are eligible for a subsidy, contact an enrollment assistor near you. Find assistance near you by calling 2-1-1 or visiting www.healthcare.gov.\nFor more information, visit www.healthcare.gov or call 1-800-318-2596. For in-person assistance in the City of Milwaukee, contact (414) 286-8620.\n\nWhen and where are Community Healthcare Access Program consultations held?\nCHAP employees are available to assist individuals daily at three City of Milwaukee Health Department Clinic locations. \nHow do I know if I qualify for free or low-cost health insurance?\nIf you are ready to enroll in a health insurance plan, please have recent financial information available including tax returns, pay stubs, or other income statements. Also be aware of how many dependents you have under the age of 26, as adult children may be eligible for coverage as well. Finally, if health insurance if offered as a benefit of employment, you must document that the cost of that insurance is more than 9.5% of your income. If your work insurance is higher than 9.5% of your income, you may be eligible to purchase insurance in the Marketplace. Your Certified Application Counselor can assist you in entering your information online to check what insurance options are available to you, and if any subsidy may be available.\n\nWho can I contact for more information?\nFor questions or assistance with enrollment in state or federal programs, call the City of Milwaukee Health Department Community Healthcare Access Program at (414) 286-8620.\n\nAssistance and over-the-phone enrollment is also available in more than 150 languages at www.healthcare.gov or 1-800-318-2596.\n\nTo find an enrollment site near you, Milwaukee County residents can also call 2-1-1 for assistance." },
      "Tags": {"SS": [ "Health", "Healthcare" ] },
      "Address": {"S": "Milwaukee Health Department Frank P. Zeidler Municipal Building 841 North Broadway, 3rd Floor Milwaukee, Wisconsin 53202" },
      "Phone": {"S": "If you have questions, call (414) 286-8620 today." },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://city.milwaukee.gov/health/medassist#.XoF8RohKjD4" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Word of Hope" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"ATODA" },
      "Description": {"S": "ATODA-Dually Certified Mental Health and ATODA Clinicians \n\nIndividual Counseling: Faith based and conventional evidence-based modalities of treatment, trauma informed curriculum-based treatment. \n\nTherapy Groups: Psycho-educational, Men/Women Trauma and Twelve-Step Facilitation. \n\nIntervention & Prevention: Department of Corrections, Diversion and Deferred Prosecution Agreement, OWI, Probation and Parole Referred. \n\nDay Treatment: Comprehensive evidence-based group therapy to assist individuals in breaking the cycle of daily chemical use. \n\nMild-Moderate Mental Health Counseling: Individual Counseling" },
      "Tags": {"SS": [ "Health", "Mental Health" ] },
      "Address": {"S": "22677 N. 40th Street \nMilwaukee, WI 53210" },
      "Phone": {"S": "414-447-1967" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://wordofhopeministriesinc.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Word of Hope" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Health Care Department" },
      "Description": {"S": "The Health Care Department features a “Free” Clinic for the Uninsured That’s partnered with Columbia St. Mary’scropped-ucw1 Community-Based Chronic Disease Management Clinic for anyone suffering with Hypertension, Cholesterol & Diabetes. \n\nHours of Operations: Monday 10am-2pm with a Nurse Practitioner/Doctor available. Tuesday-Friday 9am-3pm Preliminary screenings. Located at Ebenezer COGIC, 3132 N Dr Martin Luther King Dr; Milwaukee, Wisconsin. \n\nWALK-INS WELCOME \n\nFree Blood Pressure and Diabetic screenings and education classes. HIV/AIDS Education; Breast Cancer Education and Referrals/Assistance with Health Insurance: Word of Hope (414) 447-1967 ext. 247 \n\nFree HIV/AIDS Testing Site Black Health Coalition Wisconsin \n\nBlack Health Coalition of Wisconsin, Inc. \n\n3020 W. Vliet Street \n\nMilwaukee, Wisconsin 53208 \n\nPhone: (414) 933-0064 Fax: (414) 933-0084 \n\nDental Services \n\nUrgent Dental Care for the uninsured contact St. Elizabeth Ann Seton Dental clinic \n\nThe St. Elizabeth Ann Seton Dental Clinic \n1730 S. 13th St. \nMilwaukee, WI 53204 \n\nRobyn Kibler, Clinic Manager \nT: (414)383-3220 \nF: (414)383-3363 \n\nClinic Hours \nMonday through Thursday 8:00 am to 4:30 pm \nFriday 8:00 am to 12:00 pm" },
      "Tags": {"SS": [ "Health" ] },
      "Address": {"S": "22677 N. 40th Street \nMilwaukee, WI 53210" },
      "Phone": {"S": "414-447-1967" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://wordofhopeministriesinc.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Word of Hope" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Fast Forward Training Workshop" },
      "Description": {"S": "THE TRAINING DEPARTMENT SERVES AS THE BRIDGE FOR INDIVIDUALS TO ACQUIRE A SKILL THAT WILL RESULT IN A LIVABLE WAGE CAREER. \nWORD OF HOPE IS FUNDED BY THE U.S. DEPARTMENT OF LABOR THAT PROVIDES SPECIALIZED SKILL TRAINING, JOB PLACEMENT, MENTORING, CASE MANAGEMENT, AND CAREER FOCUSED COUNSELING FOR RETURNING CITIZENS. QUALIFYING PARTICIPANTS MUST HAVE A MINIMUM OF ONE MOTH UP TO 9 MONTHS REMAINING ON SENTENCING, PREFERABLE UNDER SUPERVISION FOR A MINIMUM OF 6 MONTHS, AND HAVE NO PRIOR HISTORY OF COMMITTING ANY VIOLENT OR SEXUAL CRIME. \nWOHM PROGRAM \nWORD OF HOPE ALSO RECEIVES FUNDING FROM STATE AND CITY ENTITIES FOR RESIDENTS IN CERTAIN PROMISED ZONES. PARTNERED WITH SCHOOLS LIKE MATC (MILWAUKEE AREA TECHNICAL COLLEGE), WCS AND OTHER EDUCATIONAL TRAINING INSTITUTIONS, WE ARE ABLE TO OFFER CERTIFIED TRAINING OPPORTUNITIEAS CARPENTRY, WELDING, CNC, HOSPITALITY, BRICK LAYING, ETC" },
      "Tags": {"SS": [ "Employment", "Reentry" ] },
      "Address": {"S": "22677 N. 40th Street \nMilwaukee, WI 53210" },
      "Phone": {"S": "414-447-1967" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://wordofhopeministriesinc.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Word of Hope" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Mentoring Matters" },
      "Description": {"S": "Word of Hope has a strong mentoring component that will maintain regular contact with program participants, to assist with program retention. The mentoring program sessions are aimed to encourage positive thinking and behavior through self-examination, accountability and role modeling. mentors will support participants in maintaining a career path, family reunification and social skill development. the mentoring sessions are curriculum based and primarily focus on the 7 key areas in one’s life: Family, Community, Health, Personal Development, Financial, Social and Professional. Participants will identify with change and reduction of the recidivism rate." },
      "Tags": {"SS": [ "Employment", "Mental Health", "Health" ] },
      "Address": {"S": "22677 N. 40th Street \nMilwaukee, WI 53210" },
      "Phone": {"S": "414-447-1967" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://wordofhopeministriesinc.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Blue FIre Wilderness Therapy" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Wilderness Therapy" },
      "Description": {"S": "1) Assess the Situation – Our Learning Styles Assessment will give us the knowledge and proper understanding of your child’s current situation to move forward in a productive manner. Often times, we are performing educational assessments that have never been done at a home school. We can offer a level of insight many families have never known were available. \n\n2) Address educational challenges – After the initial Learning Styles Assessment, we work to use wilderness not only as a therapeutic process for behavioral change, but also to address points of contention. In accordance with state and national standards, each client will have academic goals listed in their treatment plan, based on their Learning Styles Assessment and their Youth Outcome Questionnaire. \n\n\n3) Using nature as a unique and hands on learning environment – Through the use of our wilderness school, every day provides an opportunity to learn in a real, experiential way. For instance, we see and touch science or learn social sciences by traversing the same paths as previous generations. This experiential element helps to drive home lessons and create a lasting education environment. \n\nExperience-based educational programs can have a significant, positive impact on the social, psychological and intellectual development of adolescents. \n\n-Daniel Conrad & Diane Hedin, The Impact of Experimental Education on Adolescent Development \n\n4) Focusing on the transition home – Living in the wilderness is not a long-term solution, but it is a strong tool making positive life-long changes behaviorally and educationally. We focus on teaching translatable skills in academics, as well as emotional and behavioral growth. This eases the transition from our wilderness school program back to the “real world.” \n\n**Please note, for our young adult program, our experience is that our clients first and foremost must re-engage and find motivation before they pursue formal or even more informal forms of education. To learn more about we help instill confidence and direction in young adults, please visit our Pulsar site. \n\nTo learn more about the educational focus of blueFire Wilderness, please call us today (208) 502-2677." },
      "Tags": {"SS": [ "Mental Health", "Health", "Education" ] },
      "Address": {"S": "" },
      "Phone": {"S": "844-413-1999" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "Website\nhttps://bluefirewilderness.com/b/wilderness-therapy/wisconsin/milwaukee/\n\nhttps://www.facebook.com/bluefirewilderness/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Blue FIre Wilderness Therapy" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Equine Therapy" },
      "Description": {"S": "Horses Reflect a Child’s Emotional and Physical Reactions \nEquine therapy is a well-respected, effective therapeutic intervention for teens that utilizes horses to help create positive changes such as: \n\nImproved communication and relationships \nFacing fears and past trauma \nIdentifying unhealthy behaviors through mirroring \nEstablishing connections \nResponsibility \nGiving back \n\n\nMuch of equine therapy is facilitated by non-verbal communication skills. Horses, like many other animals, communicate non-verbally. This helps build: \n\nProblem solving \nStrong work ethic \nPersonal responsibility \nTeamwork \nConfidence \nPositive attitude \nEmotional growth \nWhat is C.R.E.A.T.E? \nC- Clarity, the most basic starting point. Have an overall focus. \nR- Recognize a Response and Reward it. \nE- Enthusiasm without Excitement. \nA- Assertiveness without Aggression. \nT- Time without Tension. \nE- Evolve, Evaluate, then Evolve again. \nTo learn more about how we use C.R.E.A.T.E. at blueFire see the video at the top of this page. \n\nDoes Equine Assisted Therapy Work? \n\nSeveral studies have been done as to the effectiveness of equine assisted therapy versus traditional therapeutic sessions. In nearly all cases adolescents who received equine therapy on average experienced greater total therapeutic change in psychosocial function than those who received no training. \n\nWe utilize an EAGALA-certified equine specialist, teamed up with a therapist, to work with your child. Equine therapy is a proven treatment for: \n\nDepression \nAnxiety \nTrauma \nBehavioral issues \nAttention deficit disorders \nRelational problems \nAutism spectrum disorders \nPersonality disorders \nGeneral lack of insight" },
      "Tags": {"SS": [ "Mental Health", "Education", "Health" ] },
      "Address": {"S": "" },
      "Phone": {"S": "844-413-1999" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "Website\nhttps://bluefirewilderness.com/b/wilderness-therapy/wisconsin/milwaukee/\n\nhttps://www.facebook.com/bluefirewilderness/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Blue FIre Wilderness Therapy" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Family Work" },
      "Description": {"S": "Dr. Murray Bowen, the father of family systems theory, suggests that individuals cannot be understood in isolation from one another, but need to be evaluated as a whole family unit. Therefore, our family systems program assesses how the client and the family interact in and out of their environment to identify new systems, tools and goals for future interactions. \n\nOur goal is not to assign blame. Rather, our goal is to help chart a new way forward. \n\nSimply, in our experience, without changes back at home, the success at blueFire rarely lasts once a child returns. \n\nWe invite all families to participate in family therapy during the therapeutic wilderness program and at the Family Spark Workshop near the middle of their child’s stay. In addition to the great work that will be done on-site during this workshop, families enjoy reconnecting with their child and witnessing the changes underway. \n\n\nThe “Spark” of Family Changes \nOur beautiful wilderness backdrop provides the perfect setting for the families to come together while addressing family issues at a 4-day intensive family retreat called Family Spark. \n\nThe Family Spark therapeutic wilderness program occurs approximately halfway through a client’s time at blueFire. This provides enough time for clients to make progress in program and evaluate the current treatment plan. By having the families participate near the halfway mark of the program, this provides family members back home ample time to develop and practice new skills and prep for their child’s eventual return. \n\nDuring the Family Spark Workshop, we work on: \n\nFamily reunification \nEquine therapy \nAdventure activities and processing \nFamily therapy with primary therapist \nParent workshop to provide tools for future success \nReview of psychological testing when appropriate \nComfortable overnight camping \nEvaluation and planning for future plans \nRepairing and Rebuilding Family Relationships \nThe family is the core unit. Our blueFire team starts with the child to help rebuild their relationships. Then, we work to repair family relations and strive to reintegrate clients into the family unit. We do this with weekly video journaling with clients to communicate the successes and struggles that they’ve had while participating in the different activities. Parents get to see and hear the changes that are occurring week to week. Parents are asked to participate in weekly phone calls with the primary therapist, as well as correspond with their child through video messages and letters. \n\nThe Family Spark therapeutic wilderness program is an integral part of rebuilding the family dynamic and beginning the changes that can occur after the blueFire therapeutic wilderness program experience ends. \n\nWe seldom see lasting change occur without strong family involvement. No one exists in a vacuum; therefore, it is by the support of family members that the individual is able to carry the change that happens at blueFire onto the next chapter of their life." },
      "Tags": {"SS": [ "Mental Health", "Health", "Education" ] },
      "Address": {"S": "" },
      "Phone": {"S": "844-413-1999" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "Website\nhttps://bluefirewilderness.com/b/wilderness-therapy/wisconsin/milwaukee/\n\nhttps://www.facebook.com/bluefirewilderness/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Nia Imani Family" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Transitional Housing Program" },
      "Description": {"S": "Nia Imani Family, Inc. is Milwaukee’s only long-term transitional housing facility (up to 24 months) with wrap-around services for it residents. It is for homeless, pregnant or young mothers between the ages of 18 and 25 most of whom are without a job or the income to support themselves and their children.\n\nWrap Around Life skills training: Women Who Live at Nia Imani Family, Inc. must commit to the following:\n\nAdhere to the rules and regulations of the program/building\nDeal with the mental health and trauma issues that their life experiences might have caused\nTake part honestly in Nia Imani Family support groups, as well as one-on-one reviews\nDevelop short and long-term goals for themselves and their families and learn to apply the CALN cycle to themselves (plan, act, observe, reflect, and start again)\nWork on self-examination and figure out their core values and life goals, so that they develop resiliency in the face of life’s adversity\nLearn self-care, responsibility and money management\nPay monthly program fees as they are able ,so they learn the importance of paying rent and not to become homeless again\nAttend PIWI classes (Parents Interaction With Infants)\nWork toward a better understanding of their and their child/children’s health and developmental stages\nLearn to be a responsible long-term tenant\nParticipate in nutritional and cooking classes\nMaintain a drug and alcohol-free home; quitting smoking is encouraged\nMaintain a clean, orderly and safe living environment\nParticipate in in-house and outside social activities and requirements of good citizenship as a part of Women of Hope\nUnderstand that there are different circles of Family, that co-participants are ”sisters” and that a support group is critical to living and learning in a good life\nProgram participants, with staff, set personal, professional and education goals for themselves and their children. Each woman utilizes programs and support services based on her individual needs and goals. Their progress is evaluated every 30 days using The Development Compass, a tool developed by Prof. Daniel Folkman , University of Wisconsin-Milwaukee (ret) and Ms. Pittman-McGee., which measures a participants ongoing progress in eight key areas.\n\nOur Residents Typically Are:\n\nHomeless, between ages of 18 and 26\nPregnant or young mothers from 53205 - 53206 zip codes and African American\nAll are working to overcome some of the following:\n\nChildhood trauma\nChronic homelessness\nViolence & sexual abuse\nUnemployment\nMental health issues\nEducational and job training deficiencies\nMilwaukee’s homelessness problem is significant and growing. In the last couple of years, Nia Imani Family calls for housing have increased 50% compared to past years.\n\nOur clients have some of the most troubled, traumatic histories of any group. These mothers’ troubles will become their children’s troubles, unless the cycle is broken. Few, if any, Milwaukee organizations help address this range of profound and chronic needs onsite, while also providing safe housing.Our Residents Typically Are:\n\nHomeless, between ages of 18 and 26\nPregnant or young mothers from 53205 - 53206 zip codes and African American\nAll are working to overcome some of the following:\n\nChildhood trauma\nChronic homelessness\nViolence & sexual abuse\nUnemployment\nMental health issues\nEducational and job training deficiencies\nMilwaukee’s homelessness problem is significant and growing. In the last couple of years, Nia Imani Family calls for housing have increased 50% compared to past years.\n\nOur clients have some of the most troubled, traumatic histories of any group. These mothers’ troubles will become their children’s troubles, unless the cycle is broken. Few, if any, Milwaukee organizations help address this range of profound and chronic needs onsite, while also providing safe housing." },
      "Tags": {"SS": [ "Housing", "Mental Health", "Health", "Employment" ] },
      "Address": {"S": "Nia Imani Family, Inc.\n1353 N. 25th Street\nMilwaukee, WI 53205" },
      "Phone": {"S": "414-933-1633" },
      "Fax": {"S": "414-933-1638" },
      "Email": {"S": "niaimanifamily19@yahoo.com" },
      "Website": {"S": "https://www.niaimanifamily.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Nia Imani Family" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Independent Living Skills" },
      "Description": {"S": "\nSecond Chance Project (Job Training): The Second Chance Project provides hands-on job training experience. A key component is the Life Skills Curriculum, a three-month skill-building program that focuses on job training and employment basics. In 2005, the Second Chance Project expanded to include the Dress for Less Boutique, a small clothing store operated by a part-time staff member and women who have completed the Life Skills Curriculum. Women who participate in the operation of the store, which sells donated new or slightly used clothing, receive small stipends and gain valuable on-the-job training. Working in the Boutique is a stepping-stone to jobs outside of Nia Imani Family. The program is supported by volunteers from the business and faith communities and supervised and implemented by Nia Imani Family staff. \n\nAll women who successfully participate in the Second Chance Project will: \n\n- complete the Life Skills Curriculum (job skills training) \n- acquire hands-on job skills by working at the on-site Dress for Less Boutique or elsewhere, \n- work with Nia Imani Family staff to create a sustainability plan for themselves and their children (including plans for housing, employment, and supporting their children’s academic success). \n\nBesides the obvious job training for our residents, the Dress for Less Boutique provides a valuable community asset in Milwaukee’s central city. There is no sizable clothing store in the entire zip code where Nia Imani Family is located, so many of our neighbors are fans of its high quality clothing at very affordable prices. \n\nThe Second Chance Project, of which the Dress for Less Boutique and the Life Skills Curriculum are large parts, has led Nia Imani Family graduates to successful, stable lives in which women live independently and support themselves and their children. \n\nNutrition and Culinary Class: Residents learn how to plan and cook nutritious and affordable meals in our on-site kitchen/culinary area. Volunteers come in twice monthly to teach the mothers how to prepare and cook cook meals that are affordable there are many pitfalls on the road to good nutrition for very low income families they learn how to grocery shop and to utilize community farmer markets and preparing nutritious meal for there child/children it makes a difference in how they learn and focus. \n\nEducation Support/Referrals: Many of the children have special educational needs related to family instability and infrequent school attendance and daycare. Mothers are helped by the Nia Imani Family program staff to establish a relationship with school officials to ensure the best academic outcomes for their children. \n\nComputer Training: A volunteer come in as needed to help women learn the basic necessary computer skills for updating there resumes and doing employment searches. \n\nFinancial Management: A volunteer from PNC Bank comes in once weekly and the Women learn budgeting, banking, and general financial planning to help ensure their future success and independence, they also meet once monthly with Nia Imani program staff. \n\nCommunity In House Meeting: Monthly meeting for all residents to address building and community issues within the environment in which they live." },
      "Tags": {"SS": [ "Employment", "Education", "Housing", "Family", "Trauma", "Childhood Tauma", "Chronic Homelessness \nViolence & Sexual Abuse", "Mental Health", "Educational and job training deficiencies" ] },
      "Address": {"S": "Nia Imani Family, Inc.\n1353 N. 25th Street\nMilwaukee, WI 53205" },
      "Phone": {"S": "414-933-1633" },
      "Fax": {"S": "414-933-1638" },
      "Email": {"S": "niaimanifamily19@yahoo.com" },
      "Website": {"S": "https://www.niaimanifamily.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Nia Imani Family" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Facing Past Traumas" },
      "Description": {"S": "Women's Support Group: Weekly, volunteer-led program focusing on the women themselves. Includes topics such as health, wellness and relationships" },
      "Tags": {"SS": [ "Mental Health", "Health", "Relationships" ] },
      "Address": {"S": "Nia Imani Family, Inc.\n1353 N. 25th Street\nMilwaukee, WI 53205" },
      "Phone": {"S": "414-933-1633" },
      "Fax": {"S": "414-933-1638" },
      "Email": {"S": "niaimanifamily19@yahoo.com" },
      "Website": {"S": "https://www.niaimanifamily.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Nia Imani Family" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Parenting Skills" },
      "Description": {"S": "Muhindi Program (Family Literacy)The Muhindi Program was started to encourage reading, educational success and positive parenting among the mothers and their children. “Muhindi” is Swahili for harvest and continues as a weekly program managed by our program staff and volunteers. The group is held twice monthly.\n\nThe Muhindi Program helps parents take a more positive and engaged role in their children’s educations. Nia Imani Family staff sometimes accompany parents to parent/teacher conferences, particularly when children have special needs or have been identified as being behind in school.\nMothers and Children Gathering Program: One evening every week, mothers and their children gather in our common area to read and play and learn together. was born from our recognition that parents needed time to socialize with each other in a safe setting that also built up bonds with their children. Many of the children at Nia Imani have experienced traumas—the breakup of their family unit, homelessness, violence, parental incarceration and substance abuse, and/or time in and out of the foster care system. Many of these children also have educational, behavioral or emotional special needs\n\nPIWI: Parent Interacting With Infants: The sessions vary, with a range of activities that focus on mother/child bonding, parent/child interaction, parenting support, and focused activities that involve parents with their child\n\nMothers-only Reading Book Club: A volunteer-led weekly program. Women read aloud from and discuss books. A light meal or snack is included. Over time, improvements in reading abilities and confidence levels are usually quite obvious. As women become more comfortable, they tend to participate more in discussions and by volunteering to read.\n\nParenting Group: Weekly program by The Milwaukee Health Department to help support mothers in their parenting.\n\nFamily Time: Moms must plan a special outing—such as a museum or library visit—to enjoy with their children once per month. Families are encouraged to explore community resources." },
      "Tags": {"SS": [ "Family", "Education", "Mental Health" ] },
      "Address": {"S": "Nia Imani Family, Inc.\n1353 N. 25th Street\nMilwaukee, WI 53205" },
      "Phone": {"S": "414-933-1633" },
      "Fax": {"S": "414-933-1638" },
      "Email": {"S": "niaimanifamily19@yahoo.com" },
      "Website": {"S": "https://www.niaimanifamily.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Nia Imani Family" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Future Planning" },
      "Description": {"S": "Graduation: Some of these young women need a strong incentive to keep them living according to the rules and expectations of change. So the Director has created a bargain with them: they get as a “dowry” of all their furniture and household goods they have been provided with through the program from our many commercial and individual donors. This will help establish themselves in their new housing which Nia Imani has help them find. And NI will give them their first month’s rent and security deposit\n\nEducation: they will have been planning their next educational goals and future job training needed to continue getting better jobs and better pay and raising their standard of living.\n\nNu Iota Alpha Sorority: each graduate becomes a member of our Alumni sorority which will give them a social group involving mutual support, social projects & Nia Imani resident mentoring." },
      "Tags": {"SS": [ "Housing", "Education", "Support" ] },
      "Address": {"S": "Nia Imani Family, Inc.\n1353 N. 25th Street\nMilwaukee, WI 53205" },
      "Phone": {"S": "414-933-1633" },
      "Fax": {"S": "414-933-1638" },
      "Email": {"S": "niaimanifamily19@yahoo.com" },
      "Website": {"S": "https://www.niaimanifamily.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Boys & Girls Club of Greater Milwaukee" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"About" },
      "Description": {"S": "With Safe, places to learn and play, positive role models, and educational programming, Boys & \nGirls Clubs of Greater Milwaukee has helped local kids and teens thrive for 131 years.\n\nOur vision is to build the community’s social and economic fabric by ensuring the academic and \ncareer success of every member that walks through our doors. We achieve this by providing more \nimpactful programs that appeal to our members, strengthen their academic performance, build \ncharacter, encourage healthy lifestyles and meet the basic needs of Milwaukee’s youth." },
      "Tags": {"SS": [ "Safe Places", "Safe to Learn", "Safe to Play", "Safety", "Postitive Role Models", "Academic Success", "Career Success", "Milwaukee's Youth", "Healthy Lifestyles"] },
      "Address": {"S": "1558 N. 6th Street \nMilwaukee, WI. 53212" },
      "Phone": {"S": "(414) 267-8100" },
      "Fax": {"S": "(414) 267-8184" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.bgcmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Boys & Girls Club of Greater Milwaukee" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Sports Program" },
      "Description": {"S": "Through sports programs, youth can learn about teamwork and accountability while\nbuilding lifelong healthy habits." },
      "Tags": {"SS": [ "Sports", "Teamwork", "Accountability", "Healthy Habits", "Friends", "Youths" ] },
      "Address": {"S": "1558 N. 6th Street \nMilwaukee, WI. 53212" },
      "Phone": {"S": "(414) 267-8101" },
      "Fax": {"S": "(414) 267-8185" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.bgcmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Boys & Girls Club of Greater Milwaukee" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"The Arts" },
      "Description": {"S": "Through exposure to arts programming, members learn critical thinking and problem solving skills" },
      "Tags": {"SS": [ "Critical Thinking", "Problem Solving", "Skills", "Arts", "Youths" ] },
      "Address": {"S": "1558 N. 6th Street \nMilwaukee, WI. 53212" },
      "Phone": {"S": "(414) 267-8102" },
      "Fax": {"S": "(414) 267-8186" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.bgcmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Boys & Girls Club of Greater Milwaukee" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Career Development" },
      "Description": {"S": "By helping youths explore different career paths, more youth will succeed in finding a rewading career and achieving financial independence." },
      "Tags": {"SS": [ "Employment" ] },
      "Address": {"S": "1558 N. 6th Street \nMilwaukee, WI. 53212" },
      "Phone": {"S": "(414) 267-8103" },
      "Fax": {"S": "(414) 267-8187" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.bgcmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Boys & Girls Club of Greater Milwaukee" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Education" },
      "Description": {"S": "From improving literary skills to college access and success programs, Boys and Girls Clubs offers educational programming suited for all members" },
      "Tags": {"SS": [ "Literacy Skills", "College Access", "Education", "Youths" ] },
      "Address": {"S": "1558 N. 6th Street \nMilwaukee, WI. 53212" },
      "Phone": {"S": "(414) 267-8104" },
      "Fax": {"S": "(414) 267-8188" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.bgcmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Boys & Girls Club of Greater Milwaukee" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Health and Wellness" },
      "Description": {"S": "Along with developing healthy habits, members learn about taking responsibilities for their actions and making positive choices throughout life." },
      "Tags": {"SS": [ "Health", "Wellness", "Healthy Habits", "Positive Choices", "Life", "Youths" ] },
      "Address": {"S": "1558 N. 6th Street \nMilwaukee, WI. 53212" },
      "Phone": {"S": "(414) 267-8105" },
      "Fax": {"S": "(414) 267-8189" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.bgcmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Boys & Girls Club of Greater Milwaukee" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Character and Leadership" },
      "Description": {"S": "Members learn about taking personal responsibilities for their actions, are given leadership roles within the Clubs and participate in community service projects" },
      "Tags": {"SS": [ "Personal Responsibilities", "Leadership", "Roles", "Community", "Service", "Projects", "Community Service Projects", "Youths" ] },
      "Address": {"S": "1558 N. 6th Street \nMilwaukee, WI. 53212" },
      "Phone": {"S": "(414) 267-8106" },
      "Fax": {"S": "(414) 267-8190" },
      "Email": {"S": "" },
      "Website": {"S": "https://www.bgcmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Center for Self Sufficiency" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Vision, Mission and Values" },
      "Description": {"S": "The Center for Self-Sufficiency, Inc. (CFSS) is a Milwaukee-based nonprofit organization. We provide family-strengthening programs to youth and adults to assist them in developing healthy life skills (attitudes and behaviors) and making choices that will have long-term positive effects on them, their family and society.\nIts Mission is to provide a foundation for people to actualize their hope and motivaton to access a good life. \nThe vision that it has is - Community revitalization through individual transformation." },
      "Tags": {"SS": [ "Strengthening Families", "Milwaukee", "Healthy Life Skills", "Attitudes", "Behaviors", "Choices", "Hope", "Long-term Positive Effects", "Community Revitalization", "Individual Transformation", "Integrity", "Evolve Immediately"] },
      "Address": {"S": "728 N. James Lovell Street, 2nd Floor \nMilwaukee WI. 53233" },
      "Phone": {"S": "(414) 270-4679" },
      "Fax": {"S": "(414) 449-4775" },
      "Email": {"S": "info@centerinc.org" },
      "Website": {"S": "www.centerinc.org" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Center for Self Sufficiency" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Healthy Relationship Education" },
      "Description": {"S": "Healthy Relationship Education and Healthy Marriage Education are offered to individuals who are economically disadvantaged and at higher risk for negative relationship outcomes. \nUnder its Vow to Succeed program, CFSS facilitates a variety of evidence-based curricula for youth and adults in schools, after-school settings, community and faith-based settings, and in correctional centers. The educational programs – which can be from 8 to 16 lessons/hours in length – are offered in a series of classes in either a one-hour session once a week or a two-day focused weekend retreat.\nThis program includes:\n\nYouth Education - focused on guiding youths in naigating the world of teen relationships; lessons in self-awareness; future direction, and planning; it includes topics such as maturity, goal-setting, peer pressure, date violence prevention, communication and conflict management. Some other topics that are covered are attractions; infatuation; intimacy; and realistic concepts of loe; the nature of romantic attractions and how to build healthy relationships. \n\nAdult Education - Focus is on relationship skill-building; healthy decision making; developing sustainable and healthy marriages and relationships that benefit indiiduals and their children; there are lessons in communication, conflict management, commitment, expectations, emotional and physical safety, and the effects that relationship choices hae on children.\n*To learn more about bringing healthy relationship and/or healthy marriage education to your classroom, community club or church group, contact LaKesha Reid at 414-270-4679." },
      "Tags": {"SS": [ "Healthy Relationship", "Healthy Marriage", "Education", "Teen Relationships", "Adult Relationship", "Self-Awareness", "Future Direction", "Planning", "Goal-Setting", "Peer Pressure", "Date Violence", "Love", "Romantic Relationships", "Intimacy", "Relationship Skill-Building", "Sustainable and Healthy Marriage", "Children", "Choices"] },
      "Address": {"S": "728 N. James Lovell Street, 2nd Floor \nMilwaukee WI. 53233" },
      "Phone": {"S": "(414) 270-4680" },
      "Fax": {"S": "(414) 449-4776" },
      "Email": {"S": "info@centerinc.org" },
      "Website": {"S": "www.centerinc.org" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Center for Self Sufficiency" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Youth Services" },
      "Description": {"S": "Under this program there are two projects they are - \nProject F.A.M. (Finding Abstinence Matters)\nThe project comes under the center's Sexual Risk Avoidance Education Program (SRAE) and is delivered to 1,800 youth, ages 10-19, who reside in the City of Milwaukee, and is designed to increase the proportion of youth who resist non-marital sexual activity and resist sexual coercion; report increased understanding of healthy relationship behaviors, dating violence, and the benefits of marriage; develop a success sequence plan for poverty prevention; and intend to refrain from underage drinking and illicit drug use.\nProject P.E.A.C.E. (Promoting Education Access, Compassion and Engagment)\nThe project services address: public health, education, and public safety concerns; disparities in access to public health services; social determinants of health; and risk and protective factors. This four-year project provides services to 100 youth who receive core services that include: Academic Education, Healthy Relationship Education, Mindfulness Based Stress Reduction, Mentoring, Work Readiness Capacity Building, Community Policing, and Holistic Case Management\nThe center hs the following partners:\nMilwaukee Police Department,\nU.W. Madison’s Pre-College Enrichment opportunity Program for Learning Excellences (P.E.O.P.L.E.),\nMilwaukee High Schools,\nJerlando F. L. Jackson, PhD\n*Contact LaKesha Reid at 414-270-4679." },
      "Tags": {"SS": [ "Youths", "Health", "Education", "Public Safety", "Mindfulness Based Stress Reduction", "Mentoring", "Work Readiness", "Capcity Building", "Community Policing", "Partnerships", "Milwaukee Police Department", "U.W. Madison's Pre-College Enrichment Program for Learning Excellences (PEOPLE)", "P.E.O.P.L.E", "Milwaukee", "Poverty Prevention", "Refrain from Underage Drinking", "Refrain from Illicit Drug Use"] },
      "Address": {"S": "728 N. James Lovell Street, 2nd Floor \nMilwaukee WI. 53233" },
      "Phone": {"S": "(414) 270-4681" },
      "Fax": {"S": "(414) 449-4777" },
      "Email": {"S": "info@centerinc.org" },
      "Website": {"S": "www.centerinc.org" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Center for Self Sufficiency" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Adult Revitalization" },
      "Description": {"S": "There are several projects that come under this program -\nWindows to Work - Partnering with Employ Milwaukee and the Wisconsin Department of Corrections, the center provides cognitive skills-based education to individuals releasing from Milwaukee Secure Detention Facility or Racine Correctional Institution to the Milwaukee area. CFSS integrates the use of evidence-based curricula with a variety of strategies including:\n Tools that lead to conflict reduction, positive relationships and communication skills\n The ability to recognize and positively respond to their risk-taking thoughts and actions\n Job readiness and career advancement services\n Support services to promote smooth reintegration.\n\nNew Pathways for Fathers and Families\nThe Center for Self-Sufficiency partners with the Milwaukee County Department of Child Support Services (CSS) on Milwaukee’s Fatherhood Initiative – Milwaukee County New Pathways for Fathers and Families. This program offers fathers ongoing instruction on Responsible Parenting, Economic Stability and Healthy Marriage, as well as case management that emphasizes coaching. This program aims to strengthen father-child engagement and promote and improve employment and economic mobility opportunities. It is open to biological, expectant, adoptive or step-fathers, as well as a person acknowledged as a father figure, to a child up to the age of 24, who lives in Milwaukee County.\n\nUnlocking Networks-Osh Kosh\nDelivers a Comprehensive Adult Reentry Program, to 150 high-risk men ages 18 and older, releasing from Oshkosh Correctional Institution into Milwaukee, WI designed to reduce recidivism for individuals who are high risk, based on the results of the COMPAS assessment or convicted of/or with a history of violent offense convictions. This program integrates core strategies of Cognitive Based Healthy Relationship Education, Behavioral Work Readiness Development, Parenting, Mentoring & Holistic Case Management.\n\nMotivated to Apprenticeship Pathways\nIn partnership with Employ Milwaukee and funding through the U.S. Department of Labor’s Employment and Training Administration CFSS provides essential skills training (employment and soft skills) and case management to youth ages 18-24 who have been involved with the criminal justice system through previous incarceration, court-ordered supervision, alternative sentencing, or through a diversion agreement to avoid prosecution. Members are paid while in training and are connected with credentialed trainings in an industry of their choice. Members are also given assistance with driver’s license recovery and other legal issues if necessary. CFSS Member Services Coordinators also provide job placement assistance.\n\nJourney 2 Unlocking My Potential\nCFSS in partnership, with Quad Graphics provides 150 individuals with employment training in the areas of Basic Math & Measurement, Safe Working Behaviors, Proper Personal Protective Equipment, Workplace Ethics/Communication, Conflict Resolution & Basic Computer Skills. Successful employees, coming through this program will have the opportunity to enroll in Quad’s Accelerated Career Training Program (ACT). ACT will provide the employees with the necessary skills to advance their careers in the print trade.\n\nTo learn more about CFSS’s Adult Services, contact LaKesha Reid at 414-270-4679." },
      "Tags": {"SS": [ "Employment", "Partnerships", "MSDF", "Cognitive Skills-Based Education", "Conflict Reduction Tools", "Positive Relationships", "Risk Taking Thoughts and Actions", "Job Readiness", "Career Advancements", "Milwaukee", "Racine", "Support Services", "Smooth Reintegration", "Fathers", "Families", "Economic Stability", "Healthy Marriage", "Responsible Parenting", "Strengthen Father-Child Engagement", "Coaching", "Father Figure", "Paid Training", "Mentoring", "Re-Entry", "US Dept. of Labor", "Computer-Based Skills", "Workplace Ethics", "Communication", "Conflict Resolution"] },
      "Address": {"S": "728 N. James Lovell Street, 2nd Floor \nMilwaukee WI. 53233" },
      "Phone": {"S": "(414) 270-4681" },
      "Fax": {"S": "(414) 449-4777" },
      "Email": {"S": "info@centerinc.org" },
      "Website": {"S": "www.centerinc.org" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Center for Self Sufficiency" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Assessment &Evaluation" },
      "Description": {"S": "Measuring the success of the programs we deliver to change participants’ attitudes and behaviors is as important to us as delivering these services. We use the results from our assessments and evaluations to continually adjust and improve our programs. We also assist other nonprofit organizations to do the same. For more information about how the CFSS evaluation team can assist your organization to collect quantitative and qualitative data, analyze results and assist in writing required funder reports, contact Carl Wesley, President & CEO, at 414-270-4679." },
      "Tags": {"SS": [ "Success", "Program Evaluation", "Program Assessment", "Data Analysis", "Data Collection" ] },
      "Address": {"S": "728 N. James Lovell Street, 2nd Floor \nMilwaukee WI. 53233" },
      "Phone": {"S": "(414) 270-4681" },
      "Fax": {"S": "(414) 449-4777" },
      "Email": {"S": "info@centerinc.org" },
      "Website": {"S": "www.centerinc.org" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Community Advocates" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Milwaukee Women's Center - Crisis Line" },
      "Description": {"S": "Provides crisis counseling/intervention, information, and referrals to mare that 12,000 callers each year. A community resource that assists callers with a variety of concerns - including homelessness, housing and legal issues, lack of food, and crisis situations like domestic violence or suicide" },
      "Tags": {"SS": [ "Crisis Line", "Mental Health", "Housing", "Health", "Justice", "Communithy Advocates" ] },
      "Address": {"S": "728 N. James Lovell Street, \nMilwaukee WI. 53233" },
      "Phone": {"S": "Community Advocates\n(414) 449-4777\n\nCommunity Advocates Public Policy Institute\n(414) 270-2950" },
      "Fax": {"S": "Community Advocates Public Policy Institute\n(414) 270-2971" },
      "Email": {"S": "" },
      "Website": {"S": "https://communityadvocates.net/welcome.html" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Community Advocates" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Milwaukee Women's Center - Domestic Violence Emergency Shelter" },
      "Description": {"S": "Dedicated to providing around -the-clock shelter and supportive services to women and children fleeing abusive relationships." },
      "Tags": {"SS": [ "Health", "Mental Health", "Housing", "Abuse", "Domestic Violence", "Counseling", "Support Groups", "Case Management", "Housing", "Addiction", "Healthy Parenting", "Community Advocates" ] },
      "Address": {"S": "728 N. James Lovell Street, \nMilwaukee WI. 53233" },
      "Phone": {"S": "Community Advocates\n(414) 449-4777\n\nCommunity Advocates Public Policy Institute\n(414) 270-2950" },
      "Fax": {"S": "Community Advocates Public Policy Institute\n(414) 270-2971" },
      "Email": {"S": "" },
      "Website": {"S": "https://communityadvocates.net/welcome.html" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Community Advocates" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Milwaukee Women's Center - Family Support Emergency Shelter" },
      "Description": {"S": "A shelter dedicated to helping impoverished families without a roof over their heads begin the journey to stable, affordable housing. The shelter fills very basic but vital needs for the familes served: security, shelter, and food. It also offers a comprehensive array of programs and services." },
      "Tags": {"SS": [ "Housing", "Shelter", "Family", "Substance abuse support", "Parenting Support Group", "Trauma-Informed children's programming", "Language assistance", "Community Advocates"] },
      "Address": {"S": "728 N. James Lovell Street, \nMilwaukee WI. 53233" },
      "Phone": {"S": "Community Advocates\n(414) 449-4777\n\nCommunity Advocates Public Policy Institute\n(414) 270-2950" },
      "Fax": {"S": "Community Advocates Public Policy Institute\n(414) 270-2971" },
      "Email": {"S": "" },
      "Website": {"S": "https://communityadvocates.net/welcome.html" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Community Advocates" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Milwaukee Women's Center - Older Abused Women's Program" },
      "Description": {"S": "The goal of the program is to reduce and eliminate violence in the lives of women age 50 and older who have been victimized by their intimate partners or adult children." },
      "Tags": {"SS": [ "Health", "Justice", "Emergency Shelter", "Women", "Older Women", "Civil and criminal justice support", "Civil and Criminal justice Advocacy", "Support Groups", "Transportation assistance", "Community Advocates" ] },
      "Address": {"S": "728 N. James Lovell Street, \nMilwaukee WI. 53233" },
      "Phone": {"S": "Community Advocates\n(414) 449-4777\n\nCommunity Advocates Public Policy Institute\n(414) 270-2950" },
      "Fax": {"S": "Community Advocates Public Policy Institute\n(414) 270-2971" },
      "Email": {"S": "" },
      "Website": {"S": "https://communityadvocates.net/welcome.html" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Community Advocates" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Milwaukee Women's Center - Children's Program" },
      "Description": {"S": "Provides specialized support services and activities for children who have witnessed or experienced family violence in their homes or who have experienced homelessness. Available to children residing in their Domestice Violence Emergency Shelter and their Family Support Center Emergency Shelter, and aims to promote a chil'd healing, safety, and resilience." },
      "Tags": {"SS": [ "Mental Health", "Children", "Homelessness", "Family Violence", "Strategies", "Tools", "Trauma-informed Care", "Daily Support", "Daily Positive Interactions", "Community Advocates"] },
      "Address": {"S": "728 N. James Lovell Street, \nMilwaukee WI. 53233" },
      "Phone": {"S": "Community Advocates\n(414) 449-4777\n\nCommunity Advocates Public Policy Institute\n(414) 270-2950" },
      "Fax": {"S": "Community Advocates Public Policy Institute\n(414) 270-2971" },
      "Email": {"S": "" },
      "Website": {"S": "https://communityadvocates.net/welcome.html" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Community Advocates" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Milwaukee Women's Center - Nevermore Batterers Treatment" },
      "Description": {"S": "An educational, support group-based program aiming to help male batterers understand and take responsibility for their violent behavior. Provides tools and knowledge, to change abusive and controlling behaviors and to prevent domestic violence in intimate partner and/or family relationships." },
      "Tags": {"SS": [ "Health", "Mental Health", "Abuse", "Domestic Violence", "Family", "Community Advocates", "Education", "Nevermore", "Male Batterers", "Healing", "Rehabilitation", "Conflict resolution skills", "non-violent communication"] },
      "Address": {"S": "728 N. James Lovell Street, \nMilwaukee WI. 53233" },
      "Phone": {"S": "Community Advocates\n(414) 449-4777\n\nCommunity Advocates Public Policy Institute\n(414) 270-2950" },
      "Fax": {"S": "Community Advocates Public Policy Institute\n(414) 270-2971" },
      "Email": {"S": "" },
      "Website": {"S": "https://communityadvocates.net/welcome.html" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Community Advocates" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Milwaukee Woman's Center - Substance Abuse Treatment" },
      "Description": {"S": "Provides substance use disorder treatment services for a wide variety of individuals. Our programming offers help for:\nWomen, with an emphasis on women who are pregnant\nSurvivors of domestic violence \nFamilies working through addiction issues\nMen with a history of domestic violence\nWomen who are incarcerated\nEnglish and Spanish speakers \n\nOur signature treatment programs are Positive Options for Women Entering Recovery (POWER) for women, including women who are pregnant, struggling with drug or alcohol abuse, and the Family Intervention Program (FIP), which provides counseling in the client's home in Spanish and English." },
      "Tags": {"SS": [ "Mental Health", "Substance Abuse", "POWER", "FIP", "Preganant", "Drug Abuse", "Alcohol Abuse", "Spanish", "English", "Families", "In Home counseling", "Community Advocates", "Health", "Education" ] },
      "Address": {"S": "728 N. James Lovell Street, \nMilwaukee WI. 53233" },
      "Phone": {"S": "Community Advocates\n(414) 449-4777\n\nCommunity Advocates Public Policy Institute\n(414) 270-2950" },
      "Fax": {"S": "Community Advocates Public Policy Institute\n(414) 270-2971" },
      "Email": {"S": "" },
      "Website": {"S": "https://communityadvocates.net/welcome.html" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Community Advocates" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Milwaukee Woman's Center - Bottomless Closet" },
      "Description": {"S": "A program that provides work-appropriate, gently used clothing and suportive services to men and women entering or re-entering the workforce. \nWomen and men preparing to return to work are referred from community and government agencies by appointment only." },
      "Tags": {"SS": [ "Education", "Re-Entry", "Employment", "Community Advocates", "Job Readiness Skills", "Self-Empowerment", "Low-income", "Mentoring", "Job Interview Prep", "Interviewing skills"] },
      "Address": {"S": "728 N. James Lovell Street, \nMilwaukee WI. 53233" },
      "Phone": {"S": "Community Advocates\n(414) 449-4777\n\nCommunity Advocates Public Policy Institute\n(414) 270-2950" },
      "Fax": {"S": "Community Advocates Public Policy Institute\n(414) 270-2971" },
      "Email": {"S": "" },
      "Website": {"S": "https://communityadvocates.net/welcome.html" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Community Advocates" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Energy Assistance" },
      "Description": {"S": "Eligible country residents of Milwaukee can apply for a one-time payment to help cover a portion of their energy bills. It also offers year-round benefits as well to help eligible utility customers reduce their bills, make upgrades or repairs to their homes or furnaces and stay connected." },
      "Tags": {"SS": [ "Housing", "Energy Assistance", "Community Advocates", "Milwaukee County", "Benefit Season" ] },
      "Address": {"S": "728 N. James Lovell Street, \nMilwaukee WI. 53233" },
      "Phone": {"S": "Community Advocates\n(414) 449-4777\n\nCommunity Advocates Public Policy Institute\n(414) 270-2950" },
      "Fax": {"S": "Community Advocates Public Policy Institute\n(414) 270-2971" },
      "Email": {"S": "" },
      "Website": {"S": "https://communityadvocates.net/welcome.html" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Community Advocates" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Tenant - Lanlord Help" },
      "Description": {"S": "Community Advocates’ Housing Department has decades of experience helping tenants and landlords successfully take care of complaints, make repairs, work out payment plans for rent and security deposits, and prevent evictions.\n\nIf you are having any of these problems, Community Advocates can help you:\n\nThe city has ordered you to leave your home because it is unsafe\nYour landlord is threatening you with eviction or you received a five-day notice to leave\nYour landlord is not making repairs to your unit\nYou fell behind on your rent because of an unexpected loss of income\nYou are trying to move into a new place but are having a hard time covering the security deposit \nYou own or rent a property and want to learn your rights and responsibilities" },
      "Tags": {"SS": [ "Housing", "Tenant", "Landlord", "Eviction", "Rent", "Security Deposit", "Repairs", "Payment plans", "Loss of income", "Community Advocates" ] },
      "Address": {"S": "728 N. James Lovell Street, \nMilwaukee WI. 53233" },
      "Phone": {"S": "" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "https://communityadvocates.net/welcome.html" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Community Advocates" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"SSI & Disability Advocacy" },
      "Description": {"S": "Interim Disability Assistance Program (IDAP)\nCommunity Advocates works with individuals who are eligible for Milwaukee County's Interim Disability Assistance Program (IDAP), which provides a monthly payment to financially needy residents 18 and older and married couples without children who are unable to work due to a disability and have a high probability of receiving federal Supplemental Security Income (SSI). The payment is issued until SSI eligibility is approved or denied, after which the IDAP payment ends. IDAP is an interest-free loan that must be repaid once a case is decided.\n\nProtective Payee Services\nCommunity Advocates provides Protective Payee services (rent payment and other allowances for necessities and discretionary spending) to individuals who are unable to adequately manage their finances. Protective Payee services are provided on a fee-for-service basis and allow clients to establish a history of bill payment, thereby improving their credit. \n\nLegal Referrals\nCommunity Advocates can provide referrals for legal representation in Social Security Disability and Supplemental Security Income (SSI) appeals.\n\nSSI Advocacy\nSSI Advocacy provides information, representation, referrals, and advocacy for individuals seeking Social Security disability benefits. In addition to direct representation on disability benefits appeals, staff work to ensure that clients have access to the resources and services they need during the appeals process and beyond. \nThis program accepts referrals only from Children's Community Health Plan, Managed Health Services, and Kenosha Department of Human Services." },
      "Tags": {"SS": [ "Advocacy", "Disability", "Social Security", "Legal Referrals", "Supplemental Security Income", "IDAP", "SSI", "Community Advocates" ] },
      "Address": {"S": "728 N. James Lovell Street, \nMilwaukee WI. 53233" },
      "Phone": {"S": "Community Advocates\n(414) 449-4777\n\nCommunity Advocates Public Policy Institute\n(414) 270-2950" },
      "Fax": {"S": "Community Advocates Public Policy Institute\n(414) 270-2971" },
      "Email": {"S": "" },
      "Website": {"S": "https://communityadvocates.net/welcome.html" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Community Advocates" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Homeless Outreach and Supportive Housing" },
      "Description": {"S": "Our Homeless Outreach Nursing Center, Autumn West Safe Haven, and Project Bridge programs provide services and resources that address the unique needs of those living with a mental illness in unstable living conditions. We utilize the Housing First philosophy that views housing as an individual's first step toward regaining independence and stability." },
      "Tags": {"SS": [ "Mental Health", "Mental Illness", "Housing", "Independence", "Housing Refuge", "Community Advocates", "Short-term housing", "Disability", "Trauma-informed Care", "Motivational Interviewing", "Harm Reduction" ] },
      "Address": {"S": "728 N. James Lovell Street, \nMilwaukee WI. 53233" },
      "Phone": {"S": "Community Advocates\n(414) 449-4777\n\nCommunity Advocates Public Policy Institute\n(414) 270-2950" },
      "Fax": {"S": "Community Advocates Public Policy Institute\n(414) 270-2971" },
      "Email": {"S": "" },
      "Website": {"S": "https://communityadvocates.net/welcome.html" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Community Advocates" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"New Pathways for Fathers and Families" },
      "Description": {"S": "A program for dads who want to learn how to become better fathers. The program aims to help low-income biological fathers, men who are expecting a child with their partner, adoptive fathers, step fathers, or a person who is serving as a father figure for a dependent child or young adult up to 24 years of age with lives in Milwaukee County." },
      "Tags": {"SS": [ "Education", "Families", "Fathers", "Workshops", "Individualized support", "Financial Outlook", "Parenting Skills", "Healthy Relationships", "Employment", "Mental Health", "Group Meetings", "Community Advocates" ] },
      "Address": {"S": "728 N. James Lovell Street, \nMilwaukee WI. 53233" },
      "Phone": {"S": "Community Advocates\n(414) 449-4777\n\nCommunity Advocates Public Policy Institute\n(414) 270-2950" },
      "Fax": {"S": "Community Advocates Public Policy Institute\n(414) 270-2971" },
      "Email": {"S": "" },
      "Website": {"S": "https://communityadvocates.net/welcome.html" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Community Advocates" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Empowerment Coalition of Milwaukee" },
      "Description": {"S": "The Empowerment Coalition of Milwaukee (ECOM) is a monthly gathering of social services professionals, advocates, and consumers organized by Community Advocates' Housing Department. ECOM meets the third Friday of the month throughout the year and explores topics that are vital to Milwaukee’s human services professionals. Topics have included social safety net benefits; housing; services and programs for teens; domestic violence prevention and intervention; energy assistance benefits; and programs and services for veterans, among others." },
      "Tags": {"SS": [ "Education", "Outreach", "Health", "Mental Health", "Housing", "Community Advocates" ] },
      "Address": {"S": "728 N. James Lovell Street, \nMilwaukee WI. 53233" },
      "Phone": {"S": "Community Advocates\n(414) 449-4777\n\nCommunity Advocates Public Policy Institute\n(414) 270-2950" },
      "Fax": {"S": "Community Advocates Public Policy Institute\n(414) 270-2971" },
      "Email": {"S": "" },
      "Website": {"S": "https://communityadvocates.net/welcome.html" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Community Advocates" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Public Policy Institute" },
      "Description": {"S": "Community Advocates' leadership created the Public Policy Institute in 2008 to address the root causes of poverty through policy advocacy and community collaboration on economic and public health issues." },
      "Tags": {"SS": [ "Public Policy", "Advocacy", "Trainning", "Community Advocates", "Community Building" ] },
      "Address": {"S": "728 N. James Lovell Street, \nMilwaukee WI. 53233" },
      "Phone": {"S": "Community Advocates\n(414) 449-4777\n\nCommunity Advocates Public Policy Institute\n(414) 270-2950" },
      "Fax": {"S": "Community Advocates Public Policy Institute\n(414) 270-2971" },
      "Email": {"S": "" },
      "Website": {"S": "https://communityadvocates.net/welcome.html" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Acts Housing" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Home Ownership" },
      "Description": {"S": "Focus:\nActs supports families who are attempting to purchase a home with cash or loan.\nWe provide one-on-one, HUD – approved home buyer counselling for individuals interested in purchasing a home for owner – occupancy.\nAs a real estate brokerage, Acts represents families in the purchase of homes for owner occupancy, primarily in central city neighborhoods. \nActs then helps families plan and execute home rehabilitation, with a focus on reclaiming vandalized foreclosures. \nOur affiliated non-profit partner, Acts Lending, Inc., provides mortgage loans for rehabilitation projects." },
      "Tags": {"SS": [ "Housing", "Home Ownership", "Homebuyer Counseling", "Real Estate", "Home Renovation", "Education", "Mortgage Loan", "Rehabilitation Project", "Owner Occupancy", "Fixer Upper", "HUD", "Home Buyer Education", "Family Housing", "Home Rehab", "Home Lending", "Real Estate Brokerage", "Online Homebuyer Counseling" ] },
      "Address": {"S": "2414 Villet St. Milwaukee, WI. 53205" },
      "Phone": {"S": "(414) 933-2215" },
      "Fax": {"S": "(414) 933-1956" },
      "Email": {"S": "acts@actshousing.org" },
      "Website": {"S": "www.actshousing.org "},
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Employ Milwaukee" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Reentry Employment Services at HOC" },
      "Description": {"S": "To help citizens overcome barriers and successfully reenter the community, as well as to provide innovative sources of talent for employers, Employ Milwaukee partners with the State of Wisconsin, local government, public and private employment and training providers, and community- and faith-based organizations to provide employment services to these individuals, inside and outside of jails and prisons. Employment services are provided pre- and post-release, including career planning (access to the Job Center of Wisconsin, resume building, job searching, skill assessments, etc.), skill training, and supportive service referrals.\nA grant from US Department of Labor allows us to provide pre- and post-release services to individuals who will be released within 180 days from the Milwaukee County House of Correction (HOC). This program integrates the Council of State Government’s Integrated Reentry & Employment Strategies (IRES) Model and provides career planning, job readiness and skills trainings, all centered around Labor Market Information, assessments of the individual, and an employment action plan. Referrals to American Job Centers are provided to participants, so that they may access WIOA programming to guide them through their transition immediately upon release" },
      "Tags": {"SS": [ "Reentry", "HOC", "House of corrections", "Career Planning", "Job Readiness", "Skills Training", "Individual assesments", "Employment action plan", "Employ milwaukee", "resume building", "job searching", "supportive service refferals" ] },
      "Address": {"S": "2342 North 27th Street Milwaukee, WI 53210" },
      "Phone": {"S": "(414) 270-1700" },
      "Fax": {"S": "(414) 225-2375" },
      "Email": {"S": "" },
      "Website": {"S": "www.employmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Employ Milwaukee" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Windows to Work" },
      "Description": {"S": "We assist participants with their employment, housing, medical and psychological needs through Windows to Work, a Wisconsin Department of Corrections-funded program. Instruction in financial literacy, work place competencies, conflict resolution and problem solving are provided through case managers who plan for successful reintegration with participants. Assessments and supports begin six months prior to prison release, with twelve months of follow up and supportive services after reintegration into the community." },
      "Tags": {"SS": [ "Employment", "Housing", "Medical", "Health", "Psychological", "Financial Literacy", "Work place Competencies", "Windows to work", "Conflict Resolution", "Problem Solving", "Reentry", "Reintegration", "Employ Milwaukee" ] },
      "Address": {"S": "2343 North 27th Street Milwaukee, WI 53210" },
      "Phone": {"S": "(414) 270-1701" },
      "Fax": {"S": "(414) 225-2376" },
      "Email": {"S": "" },
      "Website": {"S": "www.employmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Leadership MKE" },
      "Type": {"S": "" },
      "Program and Services": {"S":"About Us" },
      "Description": {"S": "Leadership MKE is a local independent expenditure organization that supports candidates who share our civic-minded vision for Milwaukee County. We seek to identify candidates who have a proven track record of working with members of both political parties and community stakeholders to accomplish positive outcomes for Milwaukee County rather than seeking personal political victories. We support a diverse group of elected officials and candidates who have demonstrated their commitment to problem solving, compromise, and addressing Milwaukee's most significant challenges, including racial justice and local government reform.\n\nElected Officials:\nMayor Dan Bukiewicz - Oak Creek City\nPatti Logsdon - Milwaukee County Board of Supervisors District 9.\nLeah Schreiber Johnson - Oak Creek - Frnaklin School Board\nFelecia MArtin - MIlwaukee COunty Board of supervisors District 7\nSilvia Ortiz-Velez - Milwaukee County Board of Sueprvisors District 12\nJEssica Carpenter - SHorewood Village Trustee\nMichelle HaugBoard\nWanda Montgomery - Brown Deer Village Board President\nRichard MoBoard\nLakeshia Myers - Assembly District 12\nRobyn Vining - Assembly District14\n\nCandidates for Milwaukee County and City\nDavid Crowley - Candidate for Milwaukee County Executive\nJfor City Comptroller\nTearman Spencer - Candidate for City Attorney\n" },
      "Tags": {"SS": [ "Elections", "Candidates", "Officials" ] },
      "Address": {"S": "NA" },
      "Phone": {"S": "NA" },
      "Fax": {"S": "NA" },
      "Email": {"S": "NA" },
      "Website": {"S": "https://leadershipmke.com/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Leadership MKE" },
      "Type": {"S": "" },
      "Program and Services": {"S":"Infrastructure & Jobs" },
      "Description": {"S": "Milwaukee County is adding new jobs, lowering unemployment, and becoming a better place to live, work, and raise a family. We need more local leaders who will make the necessary investments in infrastructure to create jobs so Milwaukee County will keep moving forward." },
      "Tags": {"SS": [ "Employment" ] },
      "Address": {"S": "NA" },
      "Phone": {"S": "NA" },
      "Fax": {"S": "NA" },
      "Email": {"S": "NA" },
      "Website": {"S": "https://leadershipmke.com/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "League of Women Voters (Milwaukee County)" },
      "Type": {"S": "" },
      "Program and Services": {"S":"Advocacy" },
      "Description": {"S": "\"The League of Women Voters is a nonpartisan, grassroots, political organization established in 1920 that advocates for informed and active participation in government. Our members are women and men who work to improve our systems of government and impact public policies through education and advocacy. The League neither supports nor opposes candidates for office at any level of government. At the same time, the League is wholeheartedly political and works to influence policy through advocacy. \nPositions by Topic:\nGovernment\n• Citizens' Rights, including voting rights, citizen rights and right to privacy in reproductive choices\n• Ballot Design\n• Government Structures & Procedures, including redistricting and other\nCounty Government\n• Administration of Justice\n• Government Financing\nNatural Resources\n• Standards & Enforcement\n• Energy \n• Air & Land Policies\n• Solid Waste Management\n• Water Quality\n• Pesticides\n• Great Lakes Ecosystem\nSocial Policy\n• Education\n• Equality\n• Health Care & Mental Health\n• Lending Industry Practices\n• Community Policy (formerly Urban Policy)\n\"" },
      "Tags": {"SS": [ "Citizens Rights", "Social Policy", "Education", "Health", "Mental Health" ] },
      "Address": {"S": "6737 W. Washington St. Suite 2218" },
      "Phone": {"S": "414-273-8683" },
      "Fax": {"S": "" },
      "Email": {"S": "league@lwvmilwaukee.org" },
      "Website": {"S": "https://www.lwvmilwaukee.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Milwaukee Community Services Corp" },
      "Type": {"S": "" },
      "Program and Services": {"S":"Education" },
      "Description": {"S": "The Milwaukee Community Service Corps’ educational component is one of two vital necessities to employment. The educational component is designed to give individuals a needed boost for employment in many industries. MCSC has continuous talks with employers about what they are looking for when they hire individuals for entry level jobs. This is what guides our education department. \n\nWith this information, MCSC has come up with proven courses that are national and state recognized" },
      "Tags": {"SS": [ "Education", "Employment" ] },
      "Address": {"S": "1441 N. 7th St. \nMilwaukee, WI. 53205" },
      "Phone": {"S": "(414) 372-9040" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "www.milwaukeecommunityservicecorps.org" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Milwaukee Community Services Corp" },
      "Type": {"S": "" },
      "Program and Services": {"S":"Hands on Job Training" },
      "Description": {"S": "MCSC’s Hand-on job training or Work Projects Departments is the second necessary component for future employment. It is a mini construction company. Our Work Projects department employs on average 5 Supervisors/Instructors. All of these instructors are veteran trades people who have multiple years and experience in various construction aspects. A Supervisor will lead a crew of no more than 5 Corps Members daily. The projects they will go out and work on include turf maintenance, tree planting, beach cleanup, installation of fencing, building maintenance, rehab work and snow removal just to name a few. Corps Members will earn $11.00 per hour when working/training on these crews. They will also learn from our Supervisors." },
      "Tags": {"SS": [ "Education", "Employment" ] },
      "Address": {"S": "1441 N 7th Street Milwaukee, WI 53205" },
      "Phone": {"S": "414-372-9040" },
      "Fax": {"S": "414-372-9060" },
      "Email": {"S": "cbrown@mcscwi.org" },
      "Website": {"S": "https://www.milwaukeecommunityservicecorps.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Milwaukee Community Services Corp" },
      "Type": {"S": "" },
      "Program and Services": {"S":"Certifications" },
      "Description": {"S": "MCSC offers an array of certifications that allows a prospective employee to get ahead in the workplace. All of our certifications are national and/or state recognized. Employers of many industry sectors have specifically asked for these credentials. \n\nOSHA 10 General Industry \nOSHA 10 Construction \nOSH 30 General Industry \nOSHA 30 Construction \nForklift Training \nLead Renovator \nCPR/AED \nCPR/AED & First Aid \n40 Hour Hazwoper \n" },
      "Tags": {"SS": [ "Employment", "Education", "Certifications" ] },
      "Address": {"S": "1441 N 7th Street Milwaukee, WI 53205" },
      "Phone": {"S": "414-372-9040" },
      "Fax": {"S": "414-372-9060" },
      "Email": {"S": "cbrown@mcscwi.org" },
      "Website": {"S": "https://www.milwaukeecommunityservicecorps.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "NAACP Milwaukee" },
      "Type": {"S": "" },
      "Program and Services": {"S":"Education" },
      "Description": {"S": "Work to stop the school-to-prison pipeline. There are disciplinary processes but the actions are not equivalent to the city ordinances or state statutes. The current civil rights investigations are regarding MPS for the higher rates of suspensions towards African-American children. \nHold Dr. Posley accountable for his commitment that the Director of Student Services will sit down with the city attorney and other stakeholders to evaluate the language in the student discipline handbook. \n\nFocusing on addressing inequalities by providing urban students with equitable access to resources by being committed to providing educational and social support to students and their families. Such as but not limited to: \n-Fair and equitable school funding for all \n-Transportation \n- Qualified, effective and diverse administration and faculty \n- Develop initiatives to secure equity in access to educational opportunities. \n- Encourage STEAM (science, technology, engineering, arts and math) based academics targeting specific neighborhood schools \n\nCreate a task force with representation from these membership organizations to seek solution based outcomes in order to strengthen high schools and re-engage students to prevent dropouts Commit to ensure there is representation on the school board by individuals that represent the collective priorities of members of these organizations and the communities of which they serve." },
      "Tags": {"SS": [ "Education" ] },
      "Address": {"S": "Milwaukee Branch \n2745 N. Martin Luther King Dr. #202 \nMilwaukee, WI. 53212\n\nNAACP UW – Milwaukee Branch \n3540 N. Palmer St. \nMilwaukee WI. 53212 "},
      "Phone": {"S": "NAACP Milwaukee Phone \n414.562.1000" },
      "Fax": {"S": "" },
      "Email": {"S": "NAACP Milwaukee President Fred Royal ", "president@naacpmke.org\n\ninfo@naacpmke.org \n" },
      "Website": {"S": "" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "NAACP Milwaukee" },
      "Type": {"S": "" },
      "Program and Services": {"S":"Fair Housing" },
      "Description": {"S": "Low housing tax credits applied to developments need to be provided to the targeted populations. Minorities are not benefiting from these \n- A recent resolution passed by County Board of Supervisors included “house vouchers” as protect statues. We will work to review and amend as necessary the entire resolution to ensure that all forms of discrimination are excluded. \n\nWork with City, County, and State leadership to appoint a representative from these membership organizations in order to develop programs to secure equitable access to affordable housing and home ownership strategies. \n\nImplement Anti-Displacement strategies for vulnerable impacted residents of color in core-city neighborhoods adjacent to downtown development projects. \n\nUphold the resolution ensuring housing vouchers as a protective class status." },
      "Tags": {"SS": [ "Housing" ] },
      "Address": {"S": "Milwaukee Branch \n2745 N. Martin Luther King Dr. #202 \nMilwaukee, WI. 53212\n\nNAACP UW – Milwaukee Branch \n3540 N. Palmer St. \nMilwaukee WI. 53212 "},
      "Phone": {"S": "NAACP Milwaukee Phone \n414.562.1000" },
      "Fax": {"S": "" },
      "Email": {"S": "NAACP Milwaukee President Fred Royal ", "president@naacpmke.org\n\ninfo@naacpmke.org \n" },
      "Website": {"S": "" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "NAACP Milwaukee" },
      "Type": {"S": "" },
      "Program and Services": {"S":"Employment" },
      "Description": {"S": "- Work to ensure that the Community Advisory Committee is in place.\n- The First Source Agreement needs to be executed with Employ Milwaukee.\n- Work to ensure that there is a strategic workforce inclusion plan to reduce unemployment for African-Americans\n- Provide funding and resources for pre-employment skills training to community residents, stabilizing their economic conditions and increasing self-sufficiency\n- Provide Employment Assistance Program services to assist job-seekers to prepare for employment.\n- New job training models coupled with job placement\n- Improving and integrating current data systems" },
      "Tags": {"SS": [ "Employment" ] },
      "Address": {"S": "Milwaukee Branch \n2745 N. Martin Luther King Dr. #202 \nMilwaukee, WI. 53212\n\nNAACP UW – Milwaukee Branch \n3540 N. Palmer St. \nMilwaukee WI. 53212 "},
      "Phone": {"S": "NAACP Milwaukee Phone \n414.562.1000" },
      "Fax": {"S": "" },
      "Email": {"S": "NAACP Milwaukee President Fred Royal ", "president@naacpmke.org\n\ninfo@naacpmke.org \n" },
      "Website": {"S": "" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "NAACP Milwaukee" },
      "Type": {"S": "" },
      "Program and Services": {"S":"Health" },
      "Description": {"S": "Address the lead laterals in Milwaukee \n- Advocate for the removal of lead laterals, as well as, ensure that water filters are also provided to the schools; not just to residences. Understanding that levels at schools can vary depending on the time of testing. MPS should not have to take on this cost. \n- Work to mandate that there are school entry requirements for all children to be tested for lead poisoning prior to school entry. \n\nSexually transmitted diseases \n- Work with the City of Milwaukee Health Department and Milwaukee Public Schools to ensure that screenings are conducted on a routine basis and comprehensive education is in place. \n\nWork to ensure that all schools have updated defibrillators to optimize their emergency response on-site and capacity to save lives, as well as, partner with the City Health systems, and advocacy groups to ensure the facility and student body are adequately trained. MPS should not have to take on the cost." },
      "Tags": {"SS": [ "Health", "Sexually Transmitted Disease", "Health System in Schools" ] },
      "Address": {"S": "Milwaukee Branch \n2745 N. Martin Luther King Dr. #202 \nMilwaukee, WI. 53212\n\nNAACP UW – Milwaukee Branch \n3540 N. Palmer St. \nMilwaukee WI. 53212 "},
      "Phone": {"S": "NAACP Milwaukee Phone \n414.562.1000" },
      "Fax": {"S": "" },
      "Email": {"S": "NAACP Milwaukee President Fred Royal ", "president@naacpmke.org\n\ninfo@naacpmke.org \n" },
      "Website": {"S": "" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "NAACP Milwaukee" },
      "Type": {"S": "" },
      "Program and Services": {"S":"Criminal Justice and Police Reform and Accountability" },
      "Description": {"S": "Widespread use of body cameras and dashboard cameras\n- Fight to ensure that citizens should be allowed to review footage of critical incidents with law enforcement officers before making any statements pertaining to any encounters with law enforcement.\n\nImplement the findings of the Department of Justice Voluntary Collaborative Review\n- Broken Windows Reform and Implementation of 21st century Community Policing Model\n- Review and Revision of Police Use Deadly Force Policies\n- Comprehensive Retraining of all Police Officers\n- Comprehensive Review and Strengthening of Police Hiring Standards\n\nNational Comprehensive Anti-racial profiling Law & Religious Profiling" },
      "Tags": {"SS": [ "Reform", "Criminal Justice Reform", "Police Reform", "Accountability" ] },
      "Address": {"S": "Milwaukee Branch \n2745 N. Martin Luther King Dr. #202 \nMilwaukee, WI. 53212\n\nNAACP UW – Milwaukee Branch \n3540 N. Palmer St. \nMilwaukee WI. 53212 "},
      "Phone": {"S": "NAACP Milwaukee Phone \n414.562.1000" },
      "Fax": {"S": "" },
      "Email": {"S": "NAACP Milwaukee President Fred Royal ", "president@naacpmke.org\n\ninfo@naacpmke.org \n" },
      "Website": {"S": "" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Wisconsins Bail out the People Movement" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"About Us" },
      "Description": {"S": "Facebook: https://www.facebook.com/Wisconsin-Bail-Out-the-People-Movement-195981860448317/ \nThe Wisconsin Bail Out the People Movement is an outgrowth of the Bailout the People Movement (BOPM), a national network that was founded in October 2008 to oppose the trillion-dollar bank bailout and to demand that the people get bailed out instead. BOPM held the first national protest around joblessness calling for a “Real Jobs Program” at the G20 summit in Pittsburgh.\nBOPM has taken up the most crucial issues facing workers, students and ordinary people: including –\n• jobs; \n• foreclosures and evictions; \n• education and student rights; \n• immigrant and worker’s rights; \n• stopping racism and hate groups like the Tea Party; \n• opposing the ongoing wars that are bleeding the economy dry; \n• fighting to stop billions of dollars being given to the bank for ‘debt service’,: \n• advocating for health care for all; \n• demanding reproductive freedom and justice for women and rights for LGBTQ people and much, much more.\nWe are fighting for a national Public Works Jobs Program much like the Works Progress Administration (WPA) enacted during the Great Depression; for a moratorium on home foreclosures; to stop evictions and utility shut-offs; to have the Employee Free Choice Act implemented; and to have full rights for immigrant workers among other struggles.\n" },
      "Tags": {"SS": [ "Advocacy", "Education", "Healthcare", "Housing" ] },
      "Address": {"S": "" },
      "Phone": {"S": "(414) 395-0665" },
      "Fax": {"S": "" },
      "Email": {"S": "wibailoutpeople@gmail.com" },
      "Website": {"S": "https://www.facebook.com/Wisconsin-Bail-Out-the-People-Movement-195981860448317/ \n\n\nhttps://wibailoutpeople.org/about/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Table of the Saints" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"About Us" },
      "Description": {"S": "Our purpose is to help those who were incarcerated to make a positive transition into community and family life. Our main goals are to help the returning citizens with their re-entry process by walking in obedience as men of God and upstanding citizens in our community. Providing a social service for those seeking to successfully make a transition from incarceration back into society, by providing restorative life skills through Christ-centered after care. \n\nBy doing this transformational service we hope to reduce the problems of recidivism in our community. To actively combat the individual and community problems that contribute to the needless waste of human resources. To encourage men, to become actively aware of, and consciously cultivate their greatest potential for human development, so that they are continually becoming productive community citizens. \n\nWithout vision, people perish. What we seek is to be men coming together and building relationships along with understanding, if only for a moment. There is wisdom in a multitude of counsel." },
      "Tags": {"SS": [ "Reentry" ] },
      "Address": {"S": "Milwaukee Enterprise Building \n2821 N. 4th Street, Suite 236, \nMilwaukee, Wisconsin 53212" },
      "Phone": {"S": "(414) 374-8029 x307" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "http://www.tableofthesaints.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Table of the Saints" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Family House" },
      "Description": {"S": "On August 5, 2015 we the Table of the Saints, Inc. were gifted a two family unit home by Maureen Kilgore-Marx with the desire to keep her late husband Mr. Larry M. Kilgore’s life’s work alive. Larry Kilgore was a friend and mentor to those incarcerated and returning to the community. \n\nAfter much help with restoration from Milwaukee Friends Meeting, Marquette University and community donors we were able to open on Christmas Day for our first guest and resident Mr. Aaron Boucher. Aaron was in dire need of housing and we decided to give him a chance. Aaron was with us for a little over a year with no plans to leave soon. On February 10, 2017 Aaron went home to be with the Lord. \n\nThe Table of the Saints, Inc. is committed to helping those who are incarcerated and formerly incarcerated to make a positive transition into community and family life.Our goal is to help the returning citizens with their re-entry process through walking in obedience as men and women of God and upstanding citizens in our community. Our role is providing social services for those seeking to successfully make a transition from incarceration back into society, by providing restorative life skills through:\n- Christ-centered after care \n- Professional counseling\n- Mentoring and aftercare program.\n\nIn doing this transformational service we hope to:\n- reduce the problems of recidivism in our community\n- help each person heal and embrace their moral compass of faith, family and home \n- actively combat the individual and community problems that contribute to the needless waste of human resources\n- encourage men and women to become actively aware of, and to consciously cultivate their greatest potential for human development, so that they continually become productive community citizens." },
      "Tags": {"SS": [ "Housing" ] },
      "Address": {"S": "Milwaukee Enterprise Building \n2821 N. 4th Street, Suite 236, \nMilwaukee, Wisconsin 53212" },
      "Phone": {"S": "(414) 374-8029 x307" },
      "Fax": {"S": "" },
      "Email": {"S": "" },
      "Website": {"S": "http://www.tableofthesaints.org/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Running Rebels - Helping Milwaukee's Youth" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"After School and Summer Programs" },
      "Description": {"S": "Homework Help\nWhen: Monday-Thursday 3:00 PM – 6:30 PM\nWhere: Both locations\nWhat: Homework help provided by community volunteers. All young people in Rebel programs are required to participate in 30 mins of academics before programming.\n\nBe The Change\nWhen: Mondays 5:00 – 6:30 PM\nWhere: Running Rebels East\nWhat: African American male leadership program. Connect with male mentors and peers while participating in group discussions\n\nLady Rebels\nWhen: Mondays 5:00 – 6:30 PM\nWhere: Running Rebels Central\nWhat: A leadership program for young ladies. Connect with positive female role-models while goal setting and learning life skills.\n\nAudio/Visual Entertainment\nWhen: Wednesdays 5:00 – 6:30 PM\nWhere: Running Rebels Central\nWhat: Learn photography, videography along with anything you would need to succeed in the entertainment business such as song writing, rapping and stage presence." },
      "Tags": {"SS": [ "After School & Summer Programs", "Education", "Leadership", "Auio/Visual Entertainment"] },
      "Address": {"S": "RUNNING REBELS CENTRAL\n1300A West Fond Du Lac Avenue\nMilwaukee, Wisconsin 53205\n\nRUNNING REBELS EAST \n225 West Capitol Drive \nMilwaukee, WI 53212\n\n\n\n" },
      "Phone": {"S": "(414) 264-8222" },
      "Fax": {"S": "(414) 264-8831" },
      "Email": {"S": "info@runningrebels.org" },
      "Website": {"S": "https://runningrebels.org/programs/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Running Rebels - Helping Milwaukee's Youth" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Athletic Program" },
      "Description": {"S": "Running Rebels athletics programs are a platform for developing athletic excellence, building character, and offering a source of stability in the lives of young athletes. Staff teach youth discipline, teamwork, and dedication on and off the court. \n\nBasketball fundamentals, athletic training, and open gym are free for young people in our programs. Youth and adults not currently in Rebel programs can contact Donta.Holmes@runningrebels.org for pricing. We also rent our gym to organizations looking to host athletic events.\n\nBrochure\nhttps://runningrebels.org/wp-content/uploads/2018/04/Brochure-Color.pdf" },
      "Tags": {"SS": [ "Sports", "Teamwork", "Accountability", "Healthy Habits", "Friends", "Youths" ] },
      "Address": {"S": "RUNNING REBELS CENTRAL\n1300A West Fond Du Lac Avenue\nMilwaukee, Wisconsin 53205\n\nRUNNING REBELS EAST \n225 West Capitol Drive \nMilwaukee, WI 53212\n\n\n\n" },
      "Phone": {"S": "(414) 264-8222" },
      "Fax": {"S": "(414) 264-8831" },
      "Email": {"S": "info@runningrebels.org" },
      "Website": {"S": "https://runningrebels.org/programs/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Running Rebels - Helping Milwaukee's Youth" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Juvenile Justice Program" },
      "Description": {"S": "Running Rebels’ Juvenile Justice Programs serve some of the hardest to reach and highest risk young people in Milwaukee. These are young people who have been adjudicated and court-ordered for intensive mentoring. Running Rebels provides these young people with 24/7 mentoring and access to other positive arts, athletic, and academic programs, with the goal of getting them through their probation period and onto a more positive life path. Our professional mentors ensure that young people are attending school and acting responsibly at home and in their communities. \n\nWe believe that all youth have strengths that can be developed through meaningful relationships, structure, and support. We are very proud of the hard work that our mentors do to support and redirect these very high-risk youth. \n\nJuvenile Justice Programs: \n\nMilwaukee County Accountability Program (MCAP) \nIntensive Monitoring Program (IMP) \nA True After-Care Program (ATAC) \nIntensive Monitoring Program–Aftercare (IMP-Aftercare) \n" },
      "Tags": {"SS": [ "Justice Program", "Mentoring", "Behavioral Health" ] },
      "Address": {"S": "RUNNING REBELS CENTRAL\n1300A West Fond Du Lac Avenue\nMilwaukee, Wisconsin 53205\n\nRUNNING REBELS EAST \n225 West Capitol Drive \nMilwaukee, WI 53212\n\n\n\n" },
      "Phone": {"S": "(414) 264-8222" },
      "Fax": {"S": "(414) 264-8831" },
      "Email": {"S": "Questions about our Juvenile Justice Programs? \n\nEmail Stacey.Lindsay@runningrebels.org" },
      "Website": {"S": "https://runningrebels.org/programs/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Running Rebels - Helping Milwaukee's Youth" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Violence Free Zone" },
      "Description": {"S": "The Violence Free Zone (VFZ) is a school-based mentoring program that provides Milwaukee Public School students with additional personal, academic, and career support. VFZ mentors work directly within seven MPS middle and high schools assisting students who need additional school support by helping them set and accomplish goals, strengthen preparedness for learning, and develop strategies to reduce and resolve conflicts responsibly. The goals are to support student success and create more peaceful and cohesive school cultures. \n\nAlexander Hamilton High School \nLincoln Center of the Arts \nNorth Division High School \nBarack Obama School for Career and Technical Education \nRoosevelt Middle School of the Arts \nVincent High School of Agricultural Sciences \nWashington High School of Information Technology \n“The VFZ staff are great mentors. Being a part of the VFZ family at Roosevelt has shown me I can do amazing things in life.”(Maurion, Roosevelt Middle School of the Arts)" },
      "Tags": {"SS": [ "Education", "Violence Free" ] },
      "Address": {"S": "RUNNING REBELS CENTRAL\n1300A West Fond Du Lac Avenue\nMilwaukee, Wisconsin 53205\n\nRUNNING REBELS EAST \n225 West Capitol Drive \nMilwaukee, WI 53212\n\n\n\n" },
      "Phone": {"S": "(414) 264-8222" },
      "Fax": {"S": "(414) 264-8831" },
      "Email": {"S": "info@runningrebels.org" },
      "Website": {"S": "https://runningrebels.org/programs/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Running Rebels - Helping Milwaukee's Youth" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Higher Education Learning Program" },
      "Description": {"S": "Our Higher Education Learning Program (HELP) is focused on making college attainable for Milwaukee youth. Our main goal is to provide college-bound youth with the means to become independent adults who will, in turn, give back to their communities. HELP coaches youth through their transition into college by providing emotional and financial support throughout their entire college journey, including annual scholarships.\n\n“The HELP scholarship helped me to pay for rent and keep food in the refrigerator, which allowed me to focus on graduating.” – (DeMarcus, HELP Scholarship Recipient” Interested in learning about our HELP College Scholarship?" },
      "Tags": {"SS": [ "Higher Education", "HELP Scholarship" ] },
      "Address": {"S": "RUNNING REBELS CENTRAL\n1300A West Fond Du Lac Avenue\nMilwaukee, Wisconsin 53205\n\nRUNNING REBELS EAST \n225 West Capitol Drive \nMilwaukee, WI 53212\n\n\n\n" },
      "Phone": {"S": "(414) 264-8222" },
      "Fax": {"S": "(414) 264-8831" },
      "Email": {"S": "For more information\nEmail help@runningrebels.org "},
      "Website": {"S": "https://runningrebels.org/programs/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
      "Item": {
      "Label": {"S": "Running Rebels - Helping Milwaukee's Youth" },
      "Type": {"S": "Non-Profit" },
      "Program and Services": {"S":"Pipeline2Promise: Workforce Development" },
      "Description": {"S": "Running Rebels works to establish partnerships for our Pipeline2Promise program with businesses in our neighborhoods and beyond. The businesses commit to hiring our young people and Running Rebels provides soft skills trainings, and support to remove barriers to employment." },
      "Tags": {"SS": [ "Employment" ] },
      "Address": {"S": "RUNNING REBELS CENTRAL\n1300A West Fond Du Lac Avenue\nMilwaukee, Wisconsin 53205\n\nRUNNING REBELS EAST \n225 West Capitol Drive \nMilwaukee, WI 53212\n\n\n\n" },
      "Phone": {"S": "(414) 264-8222" },
      "Fax": {"S": "(414) 264-8831" },
      "Email": {"S": "Companies interested in partnering with Running Rebels should contact \n\nEmail\ninfo@runningrebels.org" },
      "Website": {"S": "https://runningrebels.org/programs/" },
      "Attributions": {"S": ""}
         }
      }
    },
    {
      "PutRequest": {
         "Item": {
            "Label": {"S": "Running Rebels - Helping Milwaukee's Youth" },
            "Type": {"S": "Non-Profit" },
            "Program and Services": {"S":"Mentoring Program" },
            "Description": {"S": "Community Mentoring Program\nCommunity Mentoring is a voluntary program that connects youth with a mentor who provides ongoing guidance, help youth set and pursue goals, and assist youth in connecting to out-of-school opportunities offered by Running Rebels in leadership, athletics, recreation and the arts.\nYouth eligible for the Community Mentoring Program must be:\n\n• Between the ages of 12-17\n• Be willing to work with a mentor to set and accomplish goals\n• Have no Juvenile Justice involvement\n• Have their own transportation to Running Rebels out-of-school time programming.\n\n​Please note space is limited in the Community Mentoring Program.\n\nCrisis Stabilization/ Mentoring\nCrisis Stabilization and Mentoring are one-on-one support programs for youth referred through Wraparound Milwaukee or Milwaukee County. Crisis Stabilizers and Mentors build relationships with youth by engaging with them in the out-of-school time and working on social-emotional skills." },
            "Tags": {"SS": [ "Mentoring" ] },
            "Address": {"S": "RUNNING REBELS CENTRAL\n1300A West Fond Du Lac Avenue\nMilwaukee, Wisconsin 53205\n\nRUNNING REBELS EAST \n225 West Capitol Drive \nMilwaukee, WI 53212\n\n\n\n" },
            "Phone": {"S": "(414) 264-8222" },
            "Fax": {"S": "(414) 264-8831" },
            "Email": {"S": "Questions about our Community Mentoring Program? Contact Kourtney Belvins\n\nEmail\nKourtney.Blevins@RunningRebels.org. \n\nFor questions regarding our Crisis Stabilization/Mentoring program please contact Traci Amos\n\nEmail Traci.Amos@RunningRebels.org\n\nEmail\ninfo@runningrebels.org" },
            "Website": {"S": "https://runningrebels.org/programs/" },
            "Attributions": {"S": ""}
            }
         }
      },
   ]
}
